{
  "status": 2,
  "message": "NewsDetailQuery",
  "NewsId": "2d521d1f-dd75-4a12-9bfe-db3f051f7e16",
  "NewsContent": "Since the last House of <b>Assembly election</b> which saw the Peoples Democratic Party (PDP) in Ondo State winning 21 of the 26 seats, the party has further consolidated on <b>its</b> control of the state's political space.\nIn this interview, the state Commissioner for Information, Hon Kayode Akinmade, speaks on how the Dr. Olusegun Mimiko-led PDP government has been able to endear <b>the party</b> to the people through landmark achievements.\nThe PDP in <b>Ondo State</b> seems to be consolidating <b>its</b> hold on the political terrain since <b>the last House of <b>Assembly election</b></b>.\nHow has <b>it</b> happened?\nSo far so good.\n<b>PDP in <b>Ondo</b></b> is getting sure-footed, fresher and more robust with members getting happier and more at peace with <b>themselves</b> and with the remarkable performance of <b><b>its</b> government</b>.\nIn fact, <b>it</b> could only get better because <b>that</b> is what is happening.\nThe April 11 election represented the yearnings of the people of <b>the state</b>.\n<b>It</b> was an <b>Ondo State</b> affair and our performance in <b>the election</b> is a thing <b>we</b> will continue to celebrate the people of <b>the state</b> for.\n<b>It</b> was <b>an unprecedented leap</b> forward.\n<b>We</b> secured 21 of the <b>26</b> seats in <b>the state House of Assembly</b>.\n<b>This</b> is a clear indication of acceptance of the PDP by <b>the people</b>.\nThe result of <b>that election</b> speaks volumes showing that the people of <b>Ondo</b> have implicit confidence in the leadership of Dr Olusegun Mimiko and <b>the PDP</b>.\nYou think you can repeat the <b>House of Assembly</b> election feat in future elections in <b>the state</b>?\n<b>The PDP</b> is the masses party in <b>Ondo State</b> and is well prepared.\nWe have equally embarked on a mutually inclusive restructuring programme to give every member of <b><b>the party</b>, irrespective of former political inclination</b>, a sense of belonging.\nPDP is going through genuine integration.\nLook at the recent composition of caretaker committee chairmen at the various local governments, <b>we</b> have members drawn from major interests within <b>the party</b>.\nDuring the March presidential election, <b><b><b>our</b></b> party</b> took so many things for granted, not knowing that some of <b><b>our</b></b> former leaders, trusted with sensitive positions, had planned to work with the opposition in order to wreak havoc on <b>the party</b>.\nAs soon as <b>the election</b> was done with, <b>we</b> <b>we</b>nt back to the drawing board for a quick comeback.\nWith the support of <b>the people</b>, <b>we</b> <b>we</b>re able to recover lost grounds within two <b>we</b>eks .\nThen the black legs, who undermined <b>our</b> structures in <b>the presidential election</b>, came out in <b><b>their</b></b> true col<b>our</b>s by decamping to the APC and that gave <b>us</b> the opportunity to re-strategize and <b>the result</b> shocked <b><b>their</b></b> bookmakers.\nMoreover, the issues that surrounded <b>the state</b> <b>House of <b>Assembly election</b></b> made <b>it</b> absolutely difficult for <b>our</b> people to go beyond matters connected w<b>it</b>h <b>local variables</b>.\nThe local variables are that the <b>Ondo State</b> people will determine who and who will represent <b>them</b> at the parliament of <b>the state</b>.\nYou are so confident <b>your party</b> will continue to hold sway in <b>the state</b>.\nWhere is this confidence coming from?\n<b>It</b> is coming from the demonstration of love and loyalty by the people who always demonstrate <b><b>they</b></b> appreciate the leadership and selfless commitment of <b>Governor Mimiko</b> to ensure that <b><b>they</b></b> live decent lives which is evident in the various programmes of <b>the government</b>.\nTake a look at the urban renewal feat of <b>the government</b>.\n<b>It</b> is not for fun that the United Nations honoured the governor with the <b>UN</b> Scroll of Honour Award for <b>his</b> achievements in urban renewal.\nToday, Akure major roundabouts have become some tourists attraction with the water fountain providing beautiful scenery while the greenery has become a toast to the environment, providing health benefits for the citizenry.\nWe know what the infant and maternal mortality rate was in the state before the <b>Mimiko</b> administration.\nIt was a thing of great fear to be pregnant in <b>Ondo</b> before <b>the administration</b> came on board.\nToday, <b>his</b> efforts at eradicating deaths at child birth are so pronounced that the World Health Organization (<b>WHO</b>) took <b>it</b> upon <b>it</b>self to tell the whole world that other governments should come to <b>our</b> state to understudy <b>it</b>s safe motherhood project (Abiye) which gave birth to the Mother and Child Hosp<b>it</b>al and the Agbebiye projects.\nHealth care in <b>Ondo</b>, as bad as the economy is nationwide, is still free.\n<b>That</b> is why you see <b>people</b> from neighbouring states rushing to <b>the state</b> to access the free health care.\nBut <b>we</b> are now streamlining and maximizing this opportunity for the greater benefit of <b><b>our</b> people</b> with the introduction and deployment of Kaadi Igbeayo, a multi-purpose smart card with limitless opportunities.\nIf you are not resident in <b>the state</b>, you cannot have <b><b>the card</b></b> and, before you can enjoy <b>our</b> free health now, you must present <b><b>the card</b></b>.\nThis is to ensure that <b>the health</b> and other benefits of <b><b>our</b> people</b>, in relation to education , micro-credit, transportation, agric inputs, among others, are prioritized.\nAre <b>the achievements</b> in the health sector not on account of <b>the governor</b> being a medical doctor ?\n<b>Mimiko</b> is not the only governor who is <b>a medical doctor</b>.\nThe issue is about governance w<b>it</b>h passion, <b>it</b>'s about advancing the frontiers of governance.\nBefore Mimiko's government, the only dualised road we had was the Oba Adesida Road, <b>Akure</b> and <b>it</b> was w<b>it</b>hout road furn<b>it</b>ure.\nTo the glory of God and ingenuity of the <b>Mimiko</b> government, there are about six dualised roads in <b>the state</b> now.\nThose who knew what Arakale Road used to be should be able to say what <b>it</b> is now; d<b>it</b>to for Owo, <b>Ondo</b>,Igbokoda and other roads that have been dualised or being dualised.\nThese are <b>roads constructed with the full complements including lights, drainage, millennium bus stops</b>; infact with all the road furniture available in developed countries.\nNow, see the turnaround in our education system.\nApart from the special attention <b>the government</b> is giving to the welfare of teachers, <b>our</b> Mega Schools have become a model.\nOther governments have been visiting the state to understudy <b>its</b> health and education models.\nOndo State University of Science and Technology founded in Ondo South by the previous government did not take off until <b>this government</b> came in.\nToday, students of <b>the university</b> are approaching graduation.\nThe other <b>Ondo</b> State-owned university, Akungba-Akoko is one of the best state universities, as rated by the United States Transparency International Standard.\nThe Senate Building in the university recently commissioned by <b>Governor Mimiko</b> is <b>the best in Nigeria</b>.\nMore importantly, Adekunle Ajasin University charges the least tuition fees in the country.\nThis is what we call social welfare from a responsible government and <b>the people</b> are better for <b>it</b>.\n<b>We</b> also have the free school shuttle buses for pupils across <b>the state</b>.\nIn the area of security, <b>the state</b> has witnessed peace and tranquility occasioned by the responsible leadership of <b>Mimiko</b>.\nSome of <b><b>our</b> projects</b> <b>the opposition</b> is criticizing are being copied in some of <b><b>their</b> states</b>.\nGo to Osun and Oyo, <b>they</b> are trying to follow on <b>our</b> footsteps.\n<b>They</b> too are building markets, mega schools and even aping the school <b>free shuttle buses</b> and so on.\nIn <b>Ondo</b>, government creates jobs through mechanised agriculture.\nA visit to government farms in Auga, Epe, Isuada and Ore will show how well <b>this government</b> has improved agriculture with many of <b>our</b> youths developing careers there.\nToday, cocoa farmers in <b>the state</b> will tell you the transformation that has come into <b>their</b> trade as a result of the government revolution in cocoa even as <b>our</b> chocolate experiment won an award in England.\nAre you aware that in <b>Ondo now</b>, <b>it</b> takes just eight weeks to get a C of O and for as cheap as N15,000?\nAnd you don't think the defection of some bigwigs from <b>your party</b> to the oppos<b>it</b>ion will make a difference in future elections in <b>the state</b> like <b>it</b> did at the last presidential election?\nWho are <b>the bigwigs</b>?\nAre you referring to those who left <b>our party</b> on the eve of <b>the House of <b>Assembly election</b></b> thinking <b><b>their</b></b> exit will make <b>a difference</b> and got the greatest shock of <b><b><b>their</b></b> lives</b>?\nThose you referred to as <b>bigwigs</b> are paper weight and inconsequential as far as <b>Ondo</b> politics is concerned.\nSome of the so-called bigwigs defected before <b>the state House of <b>Assembly election</b></b>.\nAhead of <b>the presidential election</b>, <b><b>we</b></b> had <b>issues</b> but <b><b>we</b></b> won bigger at the Assembly election after <b>they</b> had left.\nThis means that <b>those who left</b> are inconsequential, <b>they</b> are not <b>bigwigs</b> as you described <b>them</b>.\n<b>Their</b> leaving has no effect on <b><b><b>our</b></b> party</b>; infact, <b>it</b> brought peace, progress, fresh drive and determination to excel into <b>us</b> and <b><b><b>our</b></b> party</b> remains a strong party.\nDo you not think the domineering effect of <b>the APC</b> at the national level would rub off on the electoral fortunes of <b>the APC</b> to the disadvantage of <b>the PDP in <b>Ondo</b></b>?\nLet me say once again that <b>Ondo State</b> has never been hoodwinked by any bandwagon effect.\nThe major consideration has always been performance and commitment to collective goals and ideals.\nYou will recollect that <b>Ondo</b> was in the opposition under the regime of Pa Michael Adekunle Ajasin of the Unity Party of Nigeria, <b>UPN</b>, and yet <b>the people</b> stood by <b><b>their</b></b> mandate on account of <b><b>their</b></b> value system.\nJust as <b><b>it</b></b> was yesterday, so <b><b>it</b></b> is today because the government of the day is delivering on <b><b>it</b></b>s mandate w<b><b>it</b></b>h life impacting <b>programmes</b> throughout the state.the Assembly election after <b>they</b> had left.\nThis means that <b>those who left</b> are inconsequential, <b>they</b> are not <b>bigwigs</b> as you described <b>them</b>.\n<b><b>Their</b> leaving</b> has no effect on <b><b>our</b> party</b>; infact, <b>it</b> brought <b>peace, progress, fresh drive and determination</b> to excel into <b>us</b> and <b><b>our</b> party</b> remains <b>a strong party</b>.\nDo you not think the domineering effect of <b>the APC</b> at <b>the national level</b> would rub off on the electoral fortunes of <b>the APC</b> to the disadvantage of <b>the PDP in <b>Ondo</b></b>?\nLet <b>me</b> say once again that <b>Ondo State</b> has never been hoodwinked by any bandwagon effect.\n<b>The major consideration</b> has always been <b>performance and commitment to <b>collective goals and ideals</b></b>.\nYou will recollect that <b>Ondo</b> was in the opposition under the regime of Pa Michael Adekunle Ajasin of the <b>Unity Party of Nigeria</b>, <b>UPN</b>, and yet <b>the people</b> stood by <b><b>their</b></b> mandate on account of <b><b>their</b></b> value system.\nJust as <b><b>it</b></b> was <b>yesterday</b>, so <b><b>it</b></b> is today\n",
  "NewsTitle": "2015 Polls - How Ondo PDP Recovered Lost Grounds in Two Weeks [interview]",
  "MediaType": "News",
  "Source": "Individual.com",
  "DateTime": "2015-09-15 12:00:00.0"
}
