{
    "status": 2,
    "message": "NewsDetailQuery",
    "NewsId": "3220de9b-2907-484e-b091-dfa6fd300868",
    "NewsContent": "<b>Hillary Clinton and Donald Trump</b> run essentially evenly among registered voters in a head-to-head matchup for president in a new ABC News/Washington Post poll, testament to the strength of party loyalty as well as to Trump's anti-establishment profile and anti-immigration views.\nThe hypothetical contest stands at 46-43 percent, <b>Clinton-Trump</b>, a gap that's within the survey's margin of sampling error.\n<b>That</b> compares to a clear Clinton lead among all adults, 51-39 percent, indicating <b>her</b> broad support in groups that are less apt to be registered to vote, such as young adults and racial and ethnic minorities.\nSee PDF with full results, charts and tables here.\nThe close result in <b>this poll</b>, produced for <b>ABC</b> by Langer Research Associates , says as much about partisanship as <b>it</b> does about the candidates.\nRegistered voters divide 45-40 percent between identifying <b>themselves</b> as Democrats, or leaning that way, vs. Republicans or GOP leaners.\nAnd 82 percent of leaned Democrats say <b><b><b>they</b></b></b>'d support <b>Clinton</b>, while 76 percent of leaned Republicans say <b><b><b>they</b></b></b>'d back <b>Trump</b>, were <b><b><b>they</b></b></b> the party nominees.\n<b>That</b> said, <b>Trump</b> also is tapping factors including discontent with the political system, anti-immigration attitudes and dissatisfaction with the Obama administration.\n<b>He</b> leads <b>Clinton</b> by a broad 64-25 percent among registered voters who prefer a candidate from outside the political establishment and by 49-38 percent among <b>those who strongly distrust politicians</b>.\n<b>Trump</b> also leads <b>Clinton</b> by 73-14 percent among those who favor <b>his</b> controversial views on immigration, 74-13 percent among those who disapprove of President Obama's job performance, 68-22 percent among political conservatives and 52-36 percent among whites, a broadly pro-GOP group in recent years.\n(<b>They</b> favored Mitt Romney over <b>Obama</b> by 20 percentage points in 2012.)\nAmong evangelical white Protestants, a core <b>GOP</b> group, <b>Trump</b> leads <b>Clinton</b> by 67-22 percent.\n<b>This analysis</b> is the first slice of a new ABC/Post poll on the 2016 election.\nMore detailed results on the primaries, views of candidate attributes and attitudes about <b>the political system</b> overall will be released Monday morning.\nThere are some important provisos in evaluating <b>these results</b>.\nEarly polls are not predictive.\nThey seek to measure preferences if <b><b>the election</b></b> were today, but <b><b>the election</b></b> is not today, and if <b>it</b> were, <b>voters</b> would have had a full campaign's worth of information on which to base <b>their</b> choices - including whether to vote in the <b>first</b> place.\nCampaigns clearly do matter; front-runners have failed in past elections and single-digit candidates have surged to victory.\nPolls at this stage, then, are best used to understand attitude formation, not eventual election choices.\nStatistical analysis shows which <b>factors</b> best predict <b>Clinton</b> vs. Trump <b><b>preferences</b>, holding all else equal</b>.\nThe biggest by far is whether or not <b>registered voters</b> support Trump's positions on immigration.\n<b>That</b>'s followed by partisanship, preferring experience vs. a political outsider, ideology, race and gender.\n<b>Groups</b> Notably, in the general election matchup, <b>Trump</b> leads by 52-37 percent among men, while <b>Clinton</b> leads by 55-34 percent among women.\nFifty-three percent of wo<b>men</b> in <b>this survey</b> say <b>they</b>'re <b>Democrats</b> or lean that way, compared with 36 percent of <b>men</b>.\n<b>The results</b> produce a vast 36-point gender gap -- Trump +15 points among <b><b>men</b>, Clinton +21 among wo<b>men</b></b>.\nThe average in general election exit polls since 1976 has been 13 points; <b>the biggest</b> was <b>22 points in the Gore-Bush contest of 2000</b>.\nThe <b>Clinton-Trump</b> gender gap is more than twice as big as the Clinton-Jeb Bush gender gap in an ABC/Post poll in July, presumably reflecting Trump's controversial remarks about <b>women</b>.\nClinton's support among <b>women</b> is based on <b>her</b> overwhelming backing from college-educated <b>women</b>, 68-20 percent.\nBy contrast, <b>Trump</b> leads <b>Clinton</b> by a broad 55-34 percent among men who aren't college graduates.\n<b>He</b> runs about evenly with <b>Clinton</b> among women without a college degree and among men who've graduated from college.\nThe education gap, like <b>the gender gap</b>, is outsized.\nIn exit polls since 1980, there has been little difference in candidate support among those with <b>a college degree</b> vs. non-graduates, an average of just 2 points; the biggest gap was 11 points in 1996, when Bill Clinton 's support was higher among non-grads (+14 points) than among college graduates (+3 points).\nIn the <b><b>Clinton-Trump</b></b> matchup, there's a vast 35-point gap; <b>it</b>'s 57-31 percent, <b><b>Clinton-Trump</b></b>, among those w<b>it</b>h <b>a college degree</b>, vs. 49-40 percent, <b>Trump-Clinton</b>, among those w<b>it</b>hout one.\nIndeed, even among college-educated leaned <b>Republicans</b>, Trump's support slips to 67 percent, vs. 80 percent among <b>those without a degree</b>.\nThis reflects a challenge in Trump's support profile; while <b>he</b> does much better with less-educated registered voters, t<b>he</b>y're less likely actually to vote.\nAt the same time, <b>Trump</b> has a 20-point lead over <b><b>Clinton</b></b> among senior citizens, 55-35 percent, while <b><b>Clinton</b></b> has an even broader advantage among adults under 30, 63-27 percent.\nIn <b>this case</b> <b>it</b>'s Trump's group that has a higher propens<b>it</b>y to vote.\n<b>Clinton</b> also does vastly better than <b>Trump</b> among <b>nonwhites</b>, 72-19 percent; <b>they</b>'re a core Democratic group and a growing share of the electorate.\nAnd there's a strong regional effect, with much better results for <b>Clinton</b> in the Northeast and West, with Trump ahead in the Midwest and South.\nAgain, <b>it</b>'s largely partisanship that leads <b>the way</b>.\nMethodology This <b>ABC News/Washington Post</b> poll was conducted by landline and cellular telephone Sept. 7-10, 2015, in English and Spanish, among a random national sample of 1,003 adults, including 821 registered voters.\n<b>Results</b> have a margin of sampling error of 3.5 points for the full sample and 4.0 for <b>registered voters</b>, including the design effect.\nPartisan divisions are 33-22-35 percent, Democrats-Republicans-independents, among all adults, and 34-25-33 percent among <b>registered voters</b>.\n<b>The survey</b> was produced for ABC News by Langer Research Associates of <b>New York</b>, <b><b>N.Y.</b></b>, with sampling, data collection and tabulation by Abt-SRBI of <b>New York</b>, <b><b>N.Y.</b></b> See details on the survey's methodology here .\nr than Trump among <b><b>nonwhites</b>, 72-19 percent</b>; <b>they</b>'re a core <b>Democratic</b> group and <b>a growing share of <b>the electorate</b></b>.\nAnd there's <b>a strong regional effect</b>, with much better results for <b>Clinton</b> in the <b>Northeast</b> and <b>West</b>, with Trump ahead in the <b>Midwest</b> and <b>South</b>.\nAgain, <b>it</b>'s largely partisanship that leads <b>the way</b>.\nMethodology This <b>ABC News/Washington Post</b> poll was conducted by <b>landline and cellular telephone <b>Sept. 7-10, 2015</b></b>, in <b>English and Spanish</b>, among a random national sample of <b>1,003</b> adults, including <b>821</b> registered voters.\n<b>Results</b> have a margin of sampling error of <b>3.5</b> points for <b>the full sample</b> and 4.0 for <b>registered voters</b>, including <b>the design effect</b>.\n<b>Partisan divisions</b> are 33-22-35 percent, <b>Democrats-Republicans-independents</b>, among all adults, and 34-25-33 percent among <b>registered voters</b>.\n<b>The survey</b> was produced for <b>ABC News</b> by Langer Research Associates of <b>New York</b>, <b>N.Y.</b>, with samp\n",
    "NewsTitle": "Insider vs. Outsider Matchup Finds Clinton, Trump Near Even",
    "MediaType": "News",
    "Source": "ABC30",
    "DateTime": "2015-09-13 18:00:00"
}
