{"status":2,"message":"NewsDetailQuery","NewsId":"4662e6ab-0053-4a72-88fb-c6e190882e1e","NewsContent":"Marco Rubio has no shortage of problems with the way President Obama has conducted <b>his<\/b> foreign policy.\nThe Florida senator and GOP presidential candidate says the <b>Obama<\/b> administration left \"chaos\" behind in the Middle East after withdrawing troops from Iraq in 2011.\nIn an interview with NPR's Steve Inskeep, <b>Rubio<\/b> says that Russia has gained leverage from the perception that the United States abandoned the region.\n<b>Russia<\/b> has been sending heavy equipment — including warplanes — and troops into Syria.\n<b>Iraq<\/b> also announced an intelligence-sharing arrangement with Moscow over the weekend in the fight against ISIS.\n<b>Rubio<\/b> says <b>the United States<\/b> has failed to be a reliable ally to countries in the region battling <b>ISIS<\/b>.\nT<b>he<\/b>refore, <b>he<\/b> says, \"If left with a choice between <b><b>Russia<\/b><\/b> and nothing, t<b>he<\/b>y're going to choose <b><b>Russia<\/b><\/b>.\"\nThe U.S. has led an air campaign against <b>ISIS<\/b> in <b>Iraq<\/b> and <b>Syria<\/b>, backed by Western and Arab allies.\nBut efforts to mount a ground force to battle the extremists, or hold territory cleared by airstrikes, have flagged.\n<b>Rubio<\/b> has also pledged to scrap the nuclear deal with Iran, if elected, on <b>his<\/b> first day in office.\n<b>He<\/b> does not believe <b>Iran<\/b> will stick to <b>the deal<\/b>, despite assurances by <b>Iran<\/b>ian President Hassan Rouhani in an NPR interview <b>t<b>his<\/b> weekend<\/b> that <b>his<\/b> country has a \"religious obligation\" to do so.\n<b>Rouhani<\/b> said statements by <b>Rubio<\/b> and other <b>GOP<\/b> presidential candidates that <b>they<\/b> would like to terminate the deal fuel skepticism in <b>Iran<\/b> that <b>the U.S.<\/b> will keep <b>its<\/b> promises.\n<b>Rubio<\/b> predicts that <b>Iran<\/b> will eventually claim technicalities to \"erode the deal's restrictions on <b>them<\/b>.\"\n<b>Rubio<\/b> adds, \"<b>They<\/b>'ll challenge <b>them<\/b>, <b>they<\/b>'ll gamble that the West and <b>the United States<\/b> has so much invested in the success of this deal that we will tolerate those violations.\"\n<b>The nuclear deal<\/b> was secured on Capitol Hill despite strong opposition from <b>Rubio<\/b> and other Republicans, who control both the House and Senate.\nIn the wake of <b>House<\/b> Speaker John Boehner's surprise resignation, which <b><b>Rubio<\/b><\/b> announced to cheers at a conference of social conservatives in Washington on Friday, <b><b>Rubio<\/b><\/b> says of the frustration with the <b>GOP<\/b> establishment, \"<b>It<\/b>'s very real.\"\n\"<b>We<\/b> know people are upset that <b><b>they<\/b><\/b> elected a <b>Republican-majority<\/b> <b>Senate<\/b>, have a <b>Republican-majority<\/b> <b>House<\/b>, and yet <b><b>they<\/b><\/b> seem incapable of getting anything done,\" <b>Rubio<\/b> says.\nConservatives in Congress are likely facing another disappointment this week, as the <b>GOP<\/b> leadership appears capable of keeping the government funded past a Sept. 30 deadline, without stripping federal money for Planned Parenthood.\n<b>Rubio<\/b> says the Republican establishment gave up in the fight against <b><b>Planned Parenthood<\/b>, which was sparked by a series of sting videos against the organization that provides a range of health services, including abortions<\/b>.\n\"T<b>he<\/b>y didn't think t<b>he<\/b>y could win t<b>he<\/b> public debate, and so t<b>he<\/b>y never even tried,\" <b>he<\/b> tells <b>NPR<\/b>.\nAttacking the party establishment appears to be smart politics in a campaign season when political outsiders have captured the energy in the presidential race.\n<b>Rubio<\/b> has been in <b>politics<\/b> since <b>he<\/b> won a seat on t<b>he<\/b> West Miami City Commission in 1998.\n<b>He<\/b> then rose through the ranks of Florida's state Legislature, eventually taking the mantle of speaker in the state House of Representatives, before being elected to the U.S. Senate in 2010 with the backing of the Tea Party.\n<b>Rubio<\/b> has picked up steam recently in <b>the presidential race<\/b>, both in polls and by inheriting key campaign resources from Wisconsin Gov. Scott Walker, who dropped out of <b>the race<\/b> last week.\nPerhaps t<b>he<\/b>re's no clearer sign that <b>Rubio<\/b> is performing better than t<b>he<\/b> fact that <b>he<\/b>'s come under attack by Donald Trump.\nIn a pair of cable TV interviews <b>last week<\/b>, <b>Trump<\/b> called <b>Rubio<\/b> a \"kid\" and mocked <b>him<\/b> for getting \"sweaty\" during the last <b>GOP<\/b> debate, where several candidates complained of the heat on stage.\nSince then, the two candidates have been engaged in a tit-for-tat.\n<b>Rubio<\/b> responded by saying that <b>Trump<\/b> is \"touchy and insecure\" in an interview with Kentucky Sports Radio on Thursday.\nAt the Values Voter Summit in Washington on <b>Friday<\/b>, Trump called Rubio a \"clown\" — drawing sustained boos from the crowd of <b>social conservatives<\/b>.\n<b>I<\/b>n response, <b>Rubio<\/b> tells <b>NPR<\/b>, \"<b>I<\/b>'m not interested in the back and forth.\"\n<b>He<\/b> then went on to further <b><b>his<\/b><\/b> criticism of <b>Trump<\/b>, referring to <b><b>his<\/b><\/b> presence in the race as a \"freak show.\" \n[Trump] is <b>a very sensitive person<\/b>.\n<b>He<\/b> doesn't like to be criticized.\n<b>He<\/b> responds to criticism very poorly,\" <b>Rubio<\/b> says.\n\"<b>His<\/b> poll numbers have taken a beating, and <b>he<\/b> was embarrassed on national television at t<b>he<\/b> debate by Carly Fiorina and ot<b>he<\/b>rs.\"\n\"But this election is not going to be about <b>Donald Trump<\/b>,\" <b>Rubio<\/b> adds.\n\"<b>He<\/b> thinks <b><b>it<\/b><\/b> is, but <b><b>it<\/b><\/b>'s not about <b>him<\/b>.\n<b>It<\/b> has to be about the issues confronting <b>our<\/b> country.\nAnd <b>my<\/b> sense of <b>it<\/b> is that every time issues become prominent, <b><b>he<\/b><\/b> will say something outrageous or do something outrageous so that <b><b>he<\/b><\/b> doesn't have to talk about <b>t<b><b>he<\/b><\/b> issues<\/b>.\n\"ng that <b>Trump<\/b> is \"touchy and insecure\" in an interview with Kentucky Sports Radio on Thu\n","NewsTitle":"Sen. Marco Rubio","MediaType":"News","Source":"KUNC 91.5 FM","DateTime":"2015-09-28 09:00:00.0"}
