{"status":2,"message":"NewsDetailQuery","NewsId":"ab17024d-a237-45f4-a31e-1f088acde22e","NewsContent":"WASHINGTON - The United States came under more pressure on Sunday to help <b>Europe<\/b> find sanctuary for a flood of immigrants displaced by war and chaos, but <b>Washington<\/b> showed no signs of planning a dramatic increase in <b>its<\/b> intake of <b>refugees<\/b>.\nDavid Miliband, head of the International Rescue Committee and a former British foreign secretary, called on <b>the United States<\/b> to bring out \"the kind of leadership America has shown on these kind of issues\" in the past.\n\"<b>The United States<\/b> has always been a leader in refugee resettlement but 1,500 people over four years is such a miniscule contribution to tackling the human side of this problem,\" <b>Miliband<\/b> said on ABC's \"This Week with George Stephanopoulos.\"\nState Department spokesman John Kirby, in an interview w<b>it<\/b>h Reuters late on Saturday, offered no indication the Un<b>it<\/b>ed States would be greatly boosting the number of immigrants <b>it<\/b> would allow into the country.\n<b>He<\/b> cited the $4 billion U.S. contribution to refugee relief and reconfirmed the Obama administration's position about security concerns.\n\"T<b>he<\/b>re is a significant vetting process <b>he<\/b>re for folks from Syria that <b>we<\/b> have to follow,\" <b>he<\/b> said, adding that t<b>he<\/b> <b>Obama<\/b> administration had been in contact with European allies and was exploring options.\n<b>U.S. authorities<\/b> want to prevent militants from Islamic State or al Qaeda from slipping into the country as <b>refugees<\/b>.\nBut there are risks to sticking to current policy and not playing a more active role in helping <b>Europe<\/b>.\nAnother U.S. official, speaking on condition of anonymity, acknowledged that, given the graphic images of the refugees' plight, <b>Washington<\/b> may face an international image problem for admitting only a small number compared with European countries.\nMelissa Fleming, <b>spokeswoman for the U.N. High Commissioner on Refugees<\/b>, said <b>the Un<b>it<\/b>ed States<\/b> had not put a quota on the number of refugees <b>it<\/b> would accept.\nShe said the UNHCR had submitted almost 16,300 refugees for resettlement in <b>the <b>United States<\/b><\/b> and would continue submitting cases for consideration.\n'FUNDAMENTALLY FALLS ON EUROPE'\nAustria and Germany, which expects to receive 800,000 refugees and migrants this year, have opened <b>their<\/b> borders in recent days to thousands of mostly Syrian refugees who had been stranded in Hungary.\nPope Francis on <b>Sunday<\/b> called on every Catholic parish and religious community in <b>Europe<\/b> to take in at least one refugee family.\nSince the Syrian conflict began in early 2011, <b>the United States<\/b> has taken in <b>1,500<\/b> refugees from there, the vast majority <b>this year<\/b>.\n<b>Kirby<\/b> said as many as <b>1,500<\/b> more refugees could be admitted by the end of 2015 and maybe more next year.\nA new Facebook group, Open Homes, Open Hearts <b>US<\/b>, was circulating an online petition urging <b>Obama<\/b> administration officials to \"greatly increase the number of Syrian refugees who are resettled in <b><b>our<\/b> country<\/b> and let <b>them<\/b> know <b>you<\/b> would be willing to welcome an individual or a family into <b>you<\/b>r home.\"\nThe group's page had almost 4,800 likes as of <b>Sunday<\/b> night.\nImmigration has become a major issue in the campaign leading up to the 2016 presidential election.\nBillionaire businessman Donald Trump has risen to t<b>he<\/b> top of t<b>he<\/b> Republican field with a hardline stance calling for deportation of undocumented migrants and a wall along t<b>he<\/b> U.S.-Mexico border, but said last week <b>he<\/b> would consider allowing Syrians into <b>t<b>he<\/b> United States<\/b>.\nAnot<b>he<\/b>r <b>Republican<\/b> presidential candidate, John Kasich, also appearing on ABC's \"<b>This Week<\/b>,\" said <b>he<\/b> favored <b>a somewhat enhanced U.S. role<\/b> with <b>t<b>he<\/b> refugees<\/b> but that t<b>he<\/b> situation was not primarily a <b>Washington<\/b> problem.\n\"<b>I<\/b> think <b>we<\/b> do have a responsibility in terms of taking some more folks in, making sure t<b>he<\/b>y assimilate,\" <b>he<\/b> said.\n\"<b>This<\/b> is fundamentally an issue <b>Europe<\/b> has to come to grips with.\n<b>We<\/b> can provide some humanitarian aid to <b>them<\/b>.\"\nWriting in the New York Times, <b>Michael Ignatieff<\/b>, a former leader of <b>Canada<\/b>'s Liberal Party and now a professor at the Harvard Kennedy School, said <b>the <b>United States<\/b><\/b>, <b>Canada<\/b> and Middle East nations were wrong to consider the crisis as Europe's problem.\n<b>T<b>he<\/b> <b>United States<\/b><\/b> and <b><b>its<\/b> allies<\/b> have a responsibility to t<b>he<\/b> Syrian refugees - estimated at 4 million since civil war began in <b>t<b>he<\/b>ir<\/b> homeland - since <b>t<b>he<\/b>y<\/b> are arming Syrian rebels and fighting Islamic State in <b>t<b>he<\/b> country<\/b>, <b>he<\/b> said.\n\"Blaming <b>the Europeans<\/b> is <b>an alibi<\/b> and the rest of <b>our<\/b> excuses - like <b>the refugees<\/b> don't have the right papers - are sickening,\" <b>Ignatieff<\/b> wrote.\n<b>He<\/b> called on t<b>he<\/b> <b>United States<\/b> and <b>Canada<\/b> to take in a minimum of 25,000 Syrians and said pressure on those governments may intensify after publication in t<b>he<\/b> past week of dramatic photographs of t<b>he<\/b> refugees' plight.ome more <b>folks<\/b> in, making sure <b>t<b>he<\/b>y<\/b> assimilate,\" <b>he<\/b> said.\n\"This is fundamentally an issue <b>Europe<\/b> has to come to <b>grips<\/b> with.\n<b>We<\/b> can provide some humanitarian aid to <b>them<\/b>.\"\nWriting in the <b>New York Times<\/b>, <b>Michael Ignatieff<\/b>, a former leader of <b>Canada<\/b>'s <b>Liberal Party<\/b> and now a professor at the <b>Harvard Kennedy School<\/b>, said <b><b>the <b>United States<\/b><\/b>, <b>Canada<\/b> and Middl<\/b>\n","NewsTitle":"Critics push US to help Europe by taking more refugees","MediaType":"News","Source":"ABS-CBN News","DateTime":"2015-09-07 02:00:00.0"}
