{"status":2,"message":"NewsDetailQuery","NewsId":"b3704103-623e-44fb-9217-2e85465367c1","NewsContent":"by Paul R. Pillar \nIt now appears likely that even if the Republican-controlled Congress enacts a resolution of disapproval, any such resolution would not survive a presidential veto, which means the agreement <b>itself<\/b> will come into force.\nIt also is possible that opponents will fail to get the 60 votes needed to get such a resolution through the Senate in the first place, in which case the outcome would be decided even earlier.\nIf <b>the Iranian nuclear issue<\/b> were one that people with honestly expressed substantive differences had been addressing consistently in a sober and well-reasoned fashion, one might expect that those on the losing side of <b>that outcome<\/b> would accept the result and turn <b>their<\/b> attention to how <b>they<\/b> can participate effectively in vigorous oversight of the agreement’s implementation.\nThere are indeed substantial opportunities for <b>Congress<\/b> to exercise such oversight.\nBut debate on <b>this matter<\/b> has had a deficit of sobriety and honesty.\nSome of the principal sources of oppos<b>it<\/b>ion to <b>the agreement<\/b> have involved wanting <b>the Iranian nuclear issue<\/b> to fester indefin<b>it<\/b>ely or for the Obama administration to fail in <b><b>it<\/b>s<\/b> efforts to do something about <b>it<\/b>.\n<b>The voting<\/b> and possible vetoing <b>that<\/b> will take place later this month thus will mark only the end of one chapter in a continuing political contest.\nOpponents of <b>the agreement<\/b> will continue to try to subvert <b><b>it<\/b><\/b> even after <b><b>it<\/b><\/b> enters into force.\nThe partisan divide in sentiment on <b>the issue<\/b>, which, as Jim Lobe points out , has become increasingly sharp as reflected in opinion polls over the past year, will be one of the drivers of continued opposition.\n<b>The issue<\/b> has exhibited a familiar pattern in which members of the public who have little substantive knowledge of the matter of question take <b>their<\/b> cues from leaders of the party with which <b>they<\/b> most identify.\nA self-reinforcing cycle of adamant oppos<b><b>it<\/b><\/b>ion by <b>Republican<\/b> pol<b><b>it<\/b><\/b>icians and consequent oppos<b><b>it<\/b><\/b>ion by a cue-taking <b>Republican<\/b> base has put the Iranian nuclear issue on a similar trajectory as the Affordable Care Act—i.e., endless preoccupation by the <b>Congressional<\/b> portion of half the pol<b><b>it<\/b><\/b>ical spectrum w<b><b>it<\/b><\/b>h killing <b><b>it<\/b><\/b> rather than implementing <b><b>it<\/b><\/b>, no matter what experience may show is working or not working.\nEfforts to kill <b><b><b>the agreement<\/b><\/b><\/b>, after the votes <b>this month<\/b> that will determine whether <b><b><b>the agreement<\/b><\/b><\/b> will go into effect, will center on getting the United States not to live up to <b>its<\/b> end of <b><b><b>the agreement<\/b><\/b><\/b>.\nGiven that <b>the Un<b>it<\/b>ed States<\/b> has no obligations under the agreement other than to end some of the punishment <b>it<\/b> has been inflicting in the form of economic sanctions, the agreement-killing strategy will entail slapping new sanctions on <b>Iran<\/b> until Tehran is pressed passed the lim<b>it<\/b>s of <b>it<\/b>s tolerance for such accord-circumventing behavior.\nThe specific tactics may involve in effect restoring some of the nuclear-related sanctions that are due to be relaxed under <b>the agreement<\/b>, but under some new label such as terrorism or something having to do with other Iranian behavior.\nIdeas have already been advanced along these lines.\nOther creative ideas of <b>opponents<\/b> include having states rather than the federal government sanction Iran.\nAll such maneuvers will make <b><b>it<\/b><\/b> difficult for <b>Iran<\/b>ian leaders comm<b><b>it<\/b><\/b>ted to observance of <b><b>the agreement<\/b><\/b> to deflect charges from <b>their<\/b> domestic opponents that the Un<b><b>it<\/b><\/b>ed States snookered <b>Iran<\/b> and that <b><b>it<\/b><\/b> is not in <b>Iran<\/b>’s interests to continue to live up to <b><b>the agreement<\/b><\/b>.\nU.S. opponents of <b>the agreement<\/b> will supplement <b>their<\/b> sanctions maneuvers with continued efforts to play up any bit of Iranian behavior that is objectionable or can be portrayed as such.\nThe prominence that already has been given to the opponents’ contention that <b>sanctions relief<\/b> will be a “financial windfall” that will fund increased “nefarious” <b>Iran<\/b>ian activity in the region sets the stage, of course, for later drawing attention to just about anything that <b>Iran<\/b> will actually or allegedly be doing in the Middle East that can be objected to.\nThe argument will be that any such behavior is a direct consequence of the “windfall,” regardless of how much <b>it<\/b> actually is a matter of Tehran reacting to events not of <b>it<\/b>s own making and has l<b>it<\/b>tle or nothing to do w<b>it<\/b>h Iranian finances.\nThis will all be in addition to making public issues out of anything that can be construed as an Iranian violation of the nuclear agreement <b>itself<\/b> (which is different from the necessary process of sustained, careful, responsible oversight).\nWe have already gotten a preview of this sort of tactic with many such construals regarding Iranian observance of the Joint Plan of Action, the preliminary agreement reached in 2013, on which the actual Iranian record of compliance has been excellent.\nThe U.S. presidential election calendar has given diehard opponents of <b>the nuclear agreement<\/b> added incentive to inflict lethal sabotage on the agreement within the next 16 months.\nThe prospect of a Republican entering the White House in January 2017 may in this respect present more of a vulnerability than an opportunity for <b>opponents<\/b>.\n<b>Republican<\/b> presidential candidates have been competing w<b>it<\/b>h each other in telling the primary-voter party base how quickly and peremptorily <b>they<\/b> would renounce <b>the agreement<\/b> w<b>it<\/b>h <b>Iran<\/b>—w<b>it<\/b>h the only differences being whether <b>it<\/b> would be on the very first day in office, whether renunciation would take place before or after consulting w<b>it<\/b>h advisers, etc.\nIt would be tough for any of <b>these candidates<\/b>, if elected, to back down from such an oft-repeated pledge.\nBut such a presidential renunciation would be <b>a more direct<\/b> and blatant unilateral U.S. reneging on a multilateral accord than even some of the more aggressive sanctions-restoring tactics mentioned earlier.\nAnd such a renunciation would come after three years (counting from when the JPOA came into effect) of <b>Iran<\/b> living up to <b>its<\/b> commitments under <b>the agreement<\/b> and not moving to make a nuclear weapon.\nThe discomfort that the future president would be feeling in this s<b>it<\/b>uation would reflect what has been the underlying concern of confirmed opponents of <b>the nuclear agreement<\/b> all alongidates have been competing w<b>it<\/b>h each other in telling <b>the primary-voter party base<\/b> how quickly and peremptorily <b>they<\/b> would renounce <b>the agreement<\/b> w<b>it<\/b>h <b>Iran<\/b>—w<b>it<\/b>h <b>the only differences<\/b> being whether <b>it<\/b> would be on <b>the very first day in office<\/b>, whether renunciation would take place before or after consulting w<b>it<\/b>h <b>advisers<\/b>, etc.\nIt would be tough for any of <b>these candidates<\/b>, if elected, to back down from such an oft-repeated pledge.\nBut such a presidential renunciation would be <b>a more direct<\/b> and <b>blatant unilateral U.S. reneging on <b>a multilateral accord<\/b> than <b>even some of <b>the more aggressive sanctions-restoring tactics mentioned earlier<\/b><\/b><\/b>.\nAnd such a renunciation would come after three years (<b>counting from when <b>the JPOA<\/b> came into effect<\/b>) of <b>Iran<\/b> living up to <b>its<\/b> commitments under <b>the agreement<\/b> and not moving to make a nucle\n","NewsTitle":"The Effort to Destroy the Iran Agreement","MediaType":"Blog","Source":"LobeLog","DateTime":"2015-09-01 18:00:00.0"}
