{"status":2,"message":"NewsDetailQuery","NewsId":"b5521a54-4e42-4b56-a06a-4a453414a5f5","NewsContent":"Hillary, Trump still leading their parties as front-runners But <b>Sanders<\/b>, Carson continue to climb just below <b>them<\/b> in second place Poll shows more bad news for deposed front-runner Jeb Bush   \nBut <b>the poll<\/b> , by Fox News, also shows the up-and-coming challenges facing <b>them<\/b> within <b>their<\/b> own parties.\n<b>Sen. Bernie Sanders<\/b> continues to eat away at Clinton's front-runner status among <b>Democratic<\/b> voters, while Republican candidates Ben Carson and <b>Carly Fiorina<\/b> are gaining ground on Trump among <b>GOP<\/b> voters.\n<b>Hillary Clinton<\/b> has struggled to keep <b><b><b><b>he<\/b><\/b>r<\/b><\/b> front-runner status on t<b><b>he<\/b><\/b> <b>Democratic<\/b> side of <b>t<b><b>he<\/b><\/b> 2016 presidential race<\/b>, as a new poll shows <b>s<b><b>he<\/b><\/b><\/b> is staying afloat despite growing unfavorability numbers \nThe erosion of Clinton's lead over <b>Sanders<\/b> is perhaps the poll's most dramatic news, as the former first lady and secretary of state has tumbled from 64 percent in July 2014 to 44 percent now.\nClinton's campaign has been overwhelmed by controversy after it was revealed this spring that <b><b>she<\/b><\/b> used a private, home-based email server while <b><b>she<\/b><\/b> was <b>secretary of state<\/b>.\nThe FBI is investigating whether <b>she<\/b> mishandled any classified information.\n<b>Clinton<\/b> has denied any wrongdoing and has not been formally accused of any crime.\n<b>She<\/b> has also apologized multiple times in national interviews and is expected to testify in late October before a House committee.\nYet none of <b><b>her<\/b><\/b> efforts at atonement seem to be stopping <b><b>her<\/b><\/b> stumbling in <b>the polls<\/b>.\n<b>Her<\/b> favorability ratings are at a new low after three years of <b>Fox News<\/b> polls, for example, as only 38 percent of respondents in <b>the new poll<\/b> view <b>her<\/b> favorably, down from a high of 56 percent in June 2013.\nNone of the other major candidates had as dramatic of a downward change in <b>their<\/b> favorability numbers.\n<b><b>Trump<\/b>, for example<\/b>, is viewed favorably by 34 percent of <b>respondents<\/b> in t<b>he<\/b> new poll - virtually unchanged from t<b>he<\/b> 33 percent <b>he<\/b> received back in April 2011.\n<b>Carson<\/b> does not appear to have been harmed by <b><b>his<\/b><\/b> controversial comments about a <b>Muslim<\/b> president - <b>the poll<\/b> shows <b><b>his<\/b><\/b> favorability rating has risen from 26 percent in May to 46 percent today.\nLikewise, Fiorina's star continues to rise in terms of <b>her<\/b> favorability ratings, which have gone up from 13 percent in <b>May<\/b> to 38 percent in <b>the new poll<\/b>.\n<b>Trump<\/b> barely registered in polls taken <b>just six months<\/b> ago, but <b>his<\/b> status as the <b>GOP<\/b> presidential front-runner has stayed steady despite frequent controversies and attacks from rivals \n<b>Sanders<\/b> registered at only 3 percent in January, and now stands at 30 percent, solidly in <b>second<\/b> place behind <b>Clinton<\/b>.\nVice President Joe Biden, who is still undecided on whether to run for the office, sits in third place with 18 percent.\nAmong <b>Republicans<\/b>, Trump's rocketing rise to the top of <b>the field<\/b> has been just as dramatic.\n<b>He<\/b> wasn't even in a <b>Fox News<\/b> poll until <b>March<\/b>, w<b>he<\/b>n <b>he<\/b> received 3 percent.\n<b>His<\/b> current level of support of 26 percent is unchanged since the end of <b>July<\/b>, despite consistent controversies and attacks from other candidates.\nCarson's rise has been just as impressive as that of <b>Sanders<\/b>.\nRegistering at 9 percent at t<b>he<\/b> beginning of t<b>he<\/b> year, <b>he<\/b> has doubled that total to 18 percent, or just 8 percent behind <b>Trump<\/b>.\nRetired neurosurgeon <b>Ben Carson<\/b> has solidified <b>his<\/b> hold on <b>second<\/b> place in a new, national <b>Fox News<\/b> poll that puts <b>him<\/b> just 8 percent behind Trump among <b>Republican<\/b> voters \nLike <b>Carson<\/b>, <b>her<\/b> ascent has been steady - <b>she<\/b> only received 1 percent in a <b>Fox News<\/b> poll in <b>March<\/b>.\nSen. Marco Rubio of Florida, who has been on a mini-surge of <b>his<\/b> own over the past several days, is tied with <b>Fiorina<\/b> at 9 percent.\nFor former front-runner <b>Jeb Bush<\/b>, <b>the poll<\/b> shows the same fate as that of Clinton's - a slow-but-steady slump over the past several months.\nThe former <b>Florida<\/b> governor was at 12 percent in <b>March<\/b> but now received just 7 percent in <b>the new poll<\/b> - putting <b>him<\/b> in sixth place.\n<b>Bush<\/b> was deposed as the <b>Republican<\/b> leader over the summer after <b>Trump<\/b> entered <b>the race<\/b>.\nThe <b>Fox News<\/b> poll included 1,013 randomly chosen registered voters nationwide from Sept. 20-22.\n<b>It<\/b> has a margin of error of plus or minus 3 percentage points for all registered voters, 5 percentage points for <b>Democratic<\/b> respondents and 4.5 percentage points for <b>Republicans<\/b>.\n<b>CEO <b>Carly Fiorina<\/b><\/b>, who has notched back-to-back impressive performances in the national <b>GOP<\/b> debates, is in <b>third<\/b> place with 9 percent.\nLike <b>Carson<\/b>, <b>her<\/b> ascent has been steady - <b>she<\/b> only received 1 percent in a <b>Fox News<\/b> poll in <b>March<\/b>.\nSen. Marco Rubio of <b>Florida<\/b>, who has been on a mini-surge of <b>his<\/b> own over <b>the past several days<\/b>, is tied with <b>Fiorina<\/b> at 9 percent\n","NewsTitle":"Hillary's 'favorable' number plummets to 38 percent as Ben Carson's headline-grabbing comments about Muslims have made him MORE popular","MediaType":"News","Source":"Mail Online UK","DateTime":"2015-09-28 15:00:00"}
