{"status":2,"message":"NewsDetailQuery","NewsId":"ca605b70-4dda-4ed6-acf8-7270cc07e1e8","NewsContent":"SAN FRANCISCO, CA--(Marketwired - September 01, 2015) - The Asian American Journalists Association (AAJA) announced that <b>the organization<\/b> will partner with Asian & Pacific Islander American Vote (APIAVote) to bring a Presidential Candidate Town Hall to the 2016 AAJA National Convention August 10 - 13 in Las Vegas, NV.\n<b>This<\/b> will be the largest convergence of Asian Pacific Islander American professionals in the nation.\nSince 2008, <b>the Presidential Candidate Town Hall<\/b> has served as an avenue for <b>the <b>Asian American<\/b><\/b> and Pacific Islander (<b>AAPI<\/b>) community to place <b>AAPI<\/b> issues on the radar of campaigns and the media.\n\"APIAVote is excited to partner with AAJA in bringing <b><b>our<\/b> Town Hall<\/b> to <b>Las Vegas<\/b>,\" said Christine Chen, APIAVote Executive Director.\n\"AAPI voters are still largely untapped by <b>presidential candidates<\/b> and <b>their<\/b> parties, even though this population continues to grow.\"\nAccording to <b>Chen<\/b>, <b>the margin of victory in the state of Nevada in 2012 between the two leading candidates<\/b> was 67,806 -- though there are over 149,000 potential AAPI voters to be reached.\n\"<b>We<\/b> look forward to the participation of the Presidential candidates as <b>they<\/b> directly address this growing base of new voters,\" said <b>Chen<\/b>.\n\"<b>I<\/b>'m excited to partner with AP<b>I<\/b>AVote to welcome <b>the Presidential Candidate Town Hall<\/b> at <b>AAJA<\/b>'s 2016 convention,\" said Paul Cheung, <b>AAJA<\/b> National President.\n\"Asian <b>America<\/b>n Pacific Islanders represent the fastest growing minority group in <b>America<\/b>.\n<b>Our<\/b> partnership will bring critical issues facing the AAPI community today onto a national platform during a presidential election year.\"\nAPIAVote partners with local community groups in 22 states and works to expand the AAPI electorate by organizing ongoing voter registrations drives and get-out-the-vote activities.\n\"Based on APIAVote's poll in <b>2012<\/b>, over 31% were undecided voters and during every Presidential cycle <b>this Town Hall<\/b> plays a key role in educating <b>the AAPI electorate<\/b> and preparing <b>them<\/b> to vote on Election Day,\" said <b>Johnnie Giles<\/b>, chair of the APIAVote board of directors.\n\"AAPIs are not only visible, but actively present in this election cycle.\nWith <b>AAJA<\/b>, <b>I<\/b>'m certain that <b>we<\/b> will elevate the profile of <b><b>our<\/b><\/b> communities, and ensure <b><b>our<\/b><\/b> voices are heard.\"\nThe <b>Asia<\/b>n American Journalists Association  is a nonprofit professional and educational organization with more than 1,700 members across the United States and in <b>Asia<\/b>.\nFounded in 1981, <b>AAJA<\/b> has been at the forefront of change in the journalism industry.\nAAJA's mission is to encourage <b>Asian Americans<\/b> and Pacific Islanders (<b><b>AAPIs<\/b><\/b>) to enter the ranks of journalism, to work for fair and accurate coverage of <b><b>AAPIs<\/b><\/b>, and to increase the number of AAPI journalists and news managers in <b>the industry<\/b>.\n<b>AAJA<\/b> is an alliance partner in UNITYnd get-out-the-vote activities.\n\"Based on APIAVote's poll in <b>2012<\/b>, over 31% were <b>undecided voters<\/b> and during every Presidential cycle <b>this Town Hall<\/b> plays <b>a key role<\/b> in educating the <b>AAPI<\/b> electorate and preparing <b>them<\/b> to vote on <b>Election Day<\/b>,\" said <b><b>Johnnie Giles<\/b>, <b>chair of <b>the APIAVote board<\/b><\/b><\/b>\n","NewsTitle":"AAJA and APIAVote Partner to Bring Presidential Candidate Town Hall to 2016 AAJA Convention","MediaType":"News","Source":"BioSpace","DateTime":"2015-09-01 16:00:00.0"}
