{
  "status": 2,
  "message": "NewsDetailQuery",
  "NewsId": "e73916de-7ced-413e-93cd-28278bb50123",
  "NewsContent": "By Steve Holland\n<b><b>Trump</b>, who in the past has expressed doubts about whether <b>Obama</b> was born in the <b>United States</b></b>, was told by a man at a town hall event on Thursday in Rochester, New Hampshire, that, \"<b>We</b> have a problem in this country.\n<b>It</b>'s called Muslims.\"\n\"<b>We</b> know <b>our</b> current president is one.\nYou know <b>he</b>'s not even an American,\" <b>t<b>he</b> man</b> said.\n<b>Trump</b> did not interrupt <b>the man</b> or challenge <b>his</b> contention in any way.\nThe billionaire developer's rise to the top of the <b>Republican</b> field in <b>the race for a November 2016 presidential nominee</b> has been impervious to the various controversies that erupt around <b>him</b> almost daily.\nWhether this latest episode would prove to be an important turning point for <b>Trump</b> was yet to be seen.\nAt least one <b>Republican</b> rival, Senator Lindsey Graham of South Carolina, said <b>Trump</b> had crossed a line, creating a \"defining moment\" for <b>his</b> candidacy.\n\"<b><b><b><b><b>I</b></b></b></b></b>f <b><b><b><b><b>I</b></b></b></b></b> were <b>Donald Trump</b>, <b><b><b><b><b>I</b></b></b></b></b> would go on national television and say '<b><b><b><b><b>I</b></b></b></b></b> handled <b><b>it</b></b> poorly and if <b><b><b><b><b>I</b></b></b></b></b> had to do <b><b>it</b></b> all over again, <b><b><b><b><b>I</b></b></b></b></b> would challenge <b>his</b> question,'\" <b>Graham</b> said on MSNBC.\n\"<b>It</b>'s OK to apologize.\"\nTrump in 2011 triggered a controversy by demanding that <b>Obama</b> show evidence that <b>he</b> was born in t<b>he</b> United States.\nT<b>he</b> Democratic president produced a longer form of <b><b>his</b></b> birth certificate that made clear <b>he</b> was born in Hawaii, not Kenya, as some of <b><b>his</b></b> critics have contended.\n<b>Obama</b> is <b>a Christian who as president has attended church occasionally</b>.\n\"Is anybody really surprised that this happened at a <b>Donald Trump</b> rally?\"\n<b>White House</b> spokesman Josh Earnest told reporters when asked about the latest <b>Trump</b> controversy.\n<b>He</b> said \"the people who hold these offensive views are part of Mr. <b>Trump</b>'s base\" and that <b>Trump</b> had shown \"a willingness to countenance the offensive views of one member of <b>his</b> audience.\"\n<b>Trump</b> canceled a campaign event sc<b>he</b>duled for <b>Friday</b> in <b>South Carolina</b>, saying <b>he</b> had an important business transaction to attend to.\nTrump's reaction contrasted with how 2008 <b>Republican</b> presidential nominee John <b>McCain</b> dealt with a woman who called <b>Obama</b> an Arab at a <b>McCain</b> campaign event.\n<b>McCain</b> immediately stopped t<b>he</b> woman and called <b>Obama</b> a decent family man with whom <b>he</b> has policy differences.\n<b>Democratic</b> presidential candidates Hillary Clinton and Bernie Sanders both sharply criticized Trump on <b>Friday</b>.\n\"<b>He</b> knew or <b><b><b>he</b></b></b> should have known that what <b>that man</b> was asking was not only way out of bounds, <b>it</b> was untrue, and <b><b><b>he</b></b></b> should have, from t<b><b><b>he</b></b></b> beginning, repudiated that kind of r<b><b><b>he</b></b></b>toric, that level of hatefulness of a questioner in an audience that <b><b><b>he</b></b></b> was appearing before,\" <b>Clinton</b> told <b>reporters</b> in Durham, <b>New Hampshire</b>.\nFor more on the 2016 presidential race, see the <b>Reuters</b> blog, \"Tales from the Trail\" (httpp had shown \"a willingness to countenance the offensive views of one member of <b>his</b> audie\n",
  "NewsTitle": "Trump under fire for not correcting man who called Obama a Muslim",
  "MediaType": "News",
  "Source": "Yahoo! News",
  "DateTime": "2015-09-18 18:00:00.0"
}
