{"status":2,"message":"NewsDetailQuery","NewsId":"fe2b8181-ba23-4263-b047-4e5ceac61eae","NewsContent":"Birthers, ‘Trumpists’ and a crisis for the GOP\n<b>It<\/b> mistakes the man for the movement.\nWhile <b>we<\/b> do need to reckon with what <b>Trump <b>himself<\/b><\/b> means for U.S. politics, <b>we<\/b> need to reckon even more urgently with what can now be called the “Trumpists,” <b>a solidly right-wing ethno-nationalist voting bloc that has been growing since the mid-1990s<\/b>.\nWhat points to this story?\nThe numbers capturing the ebb and flow in the belief that Barack Obama is a <b>Muslim<\/b> and the crisis over the president’s birth certificate.\n<b>Those<\/b> are the ones to watch.During most of 2008, leading up to the presidential election, the number of poll respondents who identified <b>Obama as <b>a Muslim<\/b><\/b> was stable at about 12 percent.\nBy 2010, however, <b>it<\/b> had risen to 18 percent.And according to Gallup, the release of <b>Obama<\/b>’s long-form birth certificate in April 2011 brought only to 47 percent, from 38 percent, the number of Americans who said that <b>Obama<\/b> was “defin<b>it<\/b>ely” born in the Un<b>it<\/b>ed States.\nAnot<b>he<\/b>r 18 percent said only that <b>he<\/b> was “probably” born in t<b>he<\/b> United States.\nEven after <b>the release of <b>the birth certificate<\/b><\/b>, 23 percent of <b>Republicans<\/b> continued to hold the view that <b>Obama<\/b> was born overseas.\n<b>These<\/b>, I suggest, are your <b><b>Trump<\/b><\/b> voters.Recent polling has in fact confirmed that <b><b>Trump<\/b><\/b>, a particularly prominent “birther” in 2010 and 2011, is tapping into this constituency.\nAccording to Public Policy Polling, 66 percent of <b>his<\/b> supporters believe <b>Obama<\/b> is Muslim and 61 percent think <b>he<\/b> was not born in t<b>he<\/b> United States.T<b>he<\/b> Trumpists are our equivalent of Britain’s U.K. Independence Party (<b>UKIP<\/b>) and France’s National Front, both anti-immigrant, nationalist parties.\nFor the past five years, <b>Trumpists<\/b> have clocked in at about 20 percent of the electorate, if one tracks numbers of committed “<b>Obama<\/b> is a Muslim-ists.”\nThis makes <b>them<\/b> even more powerful than Britain’s <b>UKIP<\/b>, which won 12.6 percent of the vote in May’s parliamentary election.\n<b>These numbers<\/b> put the Trumpists on par w<b>it<\/b>h the National Front in <b>France<\/b>, which in March elections took 25 percent of <b>the vote<\/b> to the 32 percent that <b>we<\/b>nt to the center-right party of Nicholas Sarkozy.The cr<b>it<\/b>ical difference bet<b>we<\/b>en <b><b>our<\/b><\/b> nationalist faction and the European ones is that <b>their<\/b> parliamentary systems register <b>them<\/b> as “<b>parties<\/b>,” whereas <b><b>our<\/b><\/b> two-party model makes <b>it<\/b> harder to see that what <b>we<\/b>’re confronting truly is the rise of a new party.\nProvided, <b>that<\/b> is, <b>the Republicans<\/b> don’t sell <b>their<\/b> souls.If <b>the Republicans<\/b> can hang on to the convictions <b>that<\/b> make <b>them<\/b> the party of Lincoln, <b>we<\/b> ought to see the party split.\nFor the good of the country, <b>we<\/b> should hope for it.Two larger shifts in <b>our<\/b> sociopolitical landscape provide the framework necessary for understanding the Trumpists.First, there is the dramatic movement of <b>the United States<\/b> toward becoming a majority-minority country, where no ethnic group is in the majority.\n<b>We<\/b> have already crossed several Rubicons.\nIn 2011, new births were majority minority for the first time, and 2014 was the first year that minority students were in the majority at U.S. public schools.\nSeveral states are already <b>majority minority<\/b>.Predictions for when the country as a whole will become <b>majority minority<\/b> continually shift, but there is no question that this will happen within the lifetimes of today’s young people, and perhaps even within <b>my<\/b> own lifetime, if <b>I<\/b> should be blessed with longevity.\nIt is unsurprising that <b>our<\/b> clear movement in this direction should provoke resistance from those whose well-being, status and self-esteem are connected to historical privileges of “whiteness.”\nSecond, there is the Internet.\nDigital communications technologies have plainly enabled geographically dispersed people with niche interests to find one another and form communities.\nFor instance, scholars see the recent impact of the Libertarian Party on policy — beginning with successful efforts to thwart banking regulations in 1999 — as being due to the lower barriers to political influence afforded by digital tools of coordination and communication.Importantly, the <b>first<\/b> uses of the Internet to build political solidarity among those with fringe political interests emerged on the right.\nThe Drudge Report started in 1994 and Free Republic in 1996.\nThe liberal MoveOn was created only in 1998 — to respond to online anti-Clinton efforts — but <b>it<\/b> didn’t achieve prominence until 2003.\nThe other major left-leaning sites appeared after George W. Bush’s electionement in <b>this direction<\/b> should provoke resistance from those whose <b>well-being, status and self-esteem<\/b> are connected to historical privileges of “whiteness.”\n<b>Second<\/b>, there is <b>the Internet<\/b>.\n<b>Digital communications technologies<\/b> have plainly enabled <b>geographically dispersed people with <b>niche interests<\/b><\/b> to find one another and form <b>communities<\/b>.\nFor instance, <b>scholars<\/b> see the recent impact of the Libertarian Party on policy — beginning with <b>successful efforts<\/b> to thwart <b>banking regulations<\/b> in <b>1999<\/b> — as being due to <b>the lower barriers<\/b> to political influence afforded by\n","NewsTitle":"The Trumpists","MediaType":"Blog","Source":"Friends Of Liberty","DateTime":"2015-09-05 12:00:00.0"}
