{"newsId":"0a968691-8cf6-4678-88f5-13ad24b73b8b","newsContent":"Published 09/17/2015                    \n                \n                \n                    by  \nSimi Valley (United States) (AFP) \n\nTrump swiftly returned fire, living up to his billing as the campaign bulldog by attacking his rivals, further imposing himself on the race to determine who will go up against the Democratic nominee, likely Hillary Clinton. \n\n\"Mr. Trump, we don't need an apprentice in the White House, we have one right now,\" Wisconsin Governor Scott Walker told Trump -- a snarky reference to the title of the real estate mogul's reality television show. \n\nThat remark kicked off several minutes of Trump-related thrusts and parries that have come to define much of the 2016 presidential race. \n\nTen challengers flanked Trump on stage in the heavyweight clash at the Ronald Reagan Presidential Library in Simi Valley, California. \n\nThey are all seeking an opening against the man who has defied all political odds to lead the Republican race for the party's nomination ahead of the November 2016 election. \n\nAFP / Frederic J Brown \nRepublican presidential hopefuls Ben Carson (L) and Donald Trump talk before the Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California, September 16, 2015 \n\nMany are under intense pressure to deliver a breakout performance that would help separate them from the large pack of candidates vying for the White House -- or risk a campaign meltdown that could see them shunted to the side as the first state nomination votes in February draw nearer. \n\n- Trump on the attack - \n\nCarly Fiorina, the one Republican woman in the race and the only candidate to rise from last month's undercard debate to Wednesday's main stage, offered passionate calls for defunding women's health care provider Planned Parenthood, a publicly funded organization that offers abortions. \n\nFiorina, the former chief executive of Hewlett-Packard, also delivered a withering response to insulting comments about her looks that Trump made in a recent magazine interview. \n\n\"I think women all over this country heard very clearly what Mr. Trump said,\" she said, offering him a cold stare. \n\nAFP / Frederic J Brown \nRepublican presidential hopefuls George Pataki (L), Rick Santorum (C) and Rand Paul arrive for the Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California, September 16, 2015 \n\nTrump did not ignore the assaults, taking digs at rivals from virtually his first moments on stage. \n\n\"First of all, Rand Paul shouldn't even be on this stage. He's number 11 and has one percent in the polls,\" Trump said of the Kentucky senator who has signalled he would not hesitate to take the gloves off with Trump. \n\nPaul, who has slipped in the polls since brusquely criticizing Trump in the first debate, attacked Trump's \"junior high\" snarls. \n\n\"Are we not way above that? Would we not all be worried to have someone like that in charge of the nuclear arsenal?\" Paul asked. \n\nEarlier, a foursome of low-polling candidates took their shots at Trump in the \"undercard\" debate. \n\nA fiery Senator Lindsey Graham warned against nominating \"cartoon character\" Trump, while former New York governor George Pataki declared Trump \"unfit to be president of the United States.\" \n\nAFP / Frederic J Brown \nCarly Fiorina, the former chief executive of Hewlett-Packard, delivered a withering response to insulting comments about her looks that Donald Trump made in a recent magazine interview \n\nThe main event's 11 candidates clashed extensively on issues including immigration, how to handle a looming government shutdown, and dealing with Russian President Vladimir Putin. \n\nJeb Bush, perhaps the campaign's ultimate establishment Republican, has seen his political fortunes tumble in the months since Trump entered the race, and he sought to claw back some of his lost ground by projecting himself as an even-keeled conservative who can lead from day one. \n\n\"You can't just, you know, talk about this stuff and insult leaders around the world and expect a good result,\" Bush said. \n\n\"You have to do this with a steady hand, and I believe I have those skills.\" \n\n- Anti-establishment rise - \n\nAs more conventional candidates like Ohio Governor John Kasich and Senator Marco Rubio struggle to gain precious air time with the media, which is spending vast time and resources on covering Trump, another outsider, retired neurosurgeon Ben Carson, has quietly gained ground. \n\nThe latest CBS News poll found Trump still ahead at 27 percent support, but the soft-spoken Carson -- who is essentially the anti-Trump -- swelled to 23 percent. \n\nWhile it is unclear whether Carson poses an immediate threat to Trump's dominance, the rise of the doctor, who like Trump has never held public office, is more evidence of an anti-establishment wave washing over the 2016 nomination race. \n\n\"I'm extraordinarily concerned about the direction of this country, the fiscal irresponsibility, the failure to take a leadership position in the world,\" Carson said. \n?? 2015 AFP","newsSource":"Look Local","newsTitle":"Trump targeted in US Republican debate","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"608f0150-9fbb-4776-bb85-95a788cf542f","newsContent":"Donald Trump and the American Paradox \n\nBy\n\nMuhammad Al-Ghazali \n\nghazalism@gmail.co\n\nMy friend recalled how he arrived in New York on the 17th of December, 1980 on his way to read for a BA degree in Broadcast journalism at the Columbia College in Hollywood. He had chosen to transit through New York out of pure fantasy and desire to explore the city that truly never sleeps before heading to the Nigerian Embassy in Washington DC to have himself documented as a legal foreign student. That was how organized things were back then, for Nigerians who sojourned abroad to get an education. To my friend, to live in America in the 1980s was a joy to behold. I should know. By the spring of 1981, I also found myself enrolled at Kean University in New Jersey, almost within visible distance from the World Trade Center¡¯s twin towers brought down in such tragic circumstances on September 11, 2001. The 1980s, as my friend recalled with so much nostalgia, was the decade in which America gave the world Michael Jackson in his prime. America also disgorged Lionel Richie, Diana Ross, Marvin Gaye, Prince now unashamedly known as ¡°The artist¡±; unforgettable athletes such as Carl Lewis, Sugar Ray Leonard, Michael Jordan, and of course, Thomas Hearns ¨C also known as the Detroit Hitman or Motor City Cobra! \n\nAmerica, in the 1980s, my friend recalled, also gave us some of the most epic television series and movies the world had ever seen such as Dallas, Dynasty, Indiana Jones, Star Trek, the Rambo and Rocky series, as wells as Bill Corsby and Eddie Murphy. In the same decade he concluded, America elected no fewer than nine African-American mayors for some of its major cities. There was Tom Bradley in Los Angeles, California; Harold Washington in Chicago, Illinois as well as Coleman Young, Detroit, Michigan, and Norm Rice, Seattle, Washington. We also had Harvey Gantt in Charlotte, Carolina, J.O. Peterson in Memphis Tennessee, and Wilson Goode in Philadelphia, Pennsylvania. The list was concluded by Clarence Burns in Baltimore, Maryland, and James Garner for Hempstead, New York. Remarkably, this feat was achieved when it was almost thought impossible for an African-American to be elected President of the United States of America. The myth was of course comprehensively shattered in 2008 with the election of Barak Obama. Ordinarily, with Obama¡¯s election, we were fully entitled to believe that it was a measure of improved race relations in America, but in an equally remarkable irony, the statistics continue to suggest the opposite. \n\nThe days of rallies of the Ku-Klux-Klan and the burning of effigies may long have abated but hate crimes against African Americans and people of color has continued to escalate. A brief chronology is of the essence at this point. Since Obama¡¯s election, the African-American Professor, Henry Gates was subjected to the indignity of arrest for ¡°breaking¡± into his own house because the police officers who effected his arrest just could not imaging that he owned a house in the suave neighborhood. The episode, of course, prompted what came to be known as Obama¡¯s ¡®beer summit¡¯ in reference to the unique method the president chose to douse tensions generated by the outrage. \n\nAbout the same time an African American woman was also hauled into a psychiatric ward for days because the white policemen who arrested her did not believe she owned the sports car she was driving. There was also the unforgettable incident involving the murder of black teenagers the most famous of which was the one involving Trayvon Martin. And, just a few days ago, Ahmed, the five year old kindergarten student of Sudanese heritage, was arrested and handcuffed because his teacher believed the nonsense that the clock he personally constructed to impress her was a bomb! \n\nAnd yet, as if that is not enough, the shocking new incident of intolerance has coincided with the period the American Republican party frontrunner Donald heightened his nauseating rhetoric of intolerance and divisiveness in the race to pick his party¡¯s ticket to contest for the presidency next year. Before the his latest act in which he openly encouraged the notion that President Obama may be a closet Muslim ¨C as if being one is a crime in a nation in which the freedom is as sacrosanct as the freedom speech, Trump had already drawn the ire of minorities and Latinos in particular for his views against immigration. Now his latest outrage is sure to vibrate far beyond the shores of America were the various primaries that will produce the leading candidates for next year¡¯s presidential elections are being monitored closely. Can we even begin to contemplate the prospects of what will happen to the Middle East peace process with a Donald Trump in the White House? The unquestionable reality today is that Donald Trump is a problem that only Americans will have to deal with on their own. The rest of the world will have to wait and watch. In the past several decades Americans have elected Republican candidates who proceeded to leave their marks on the rest of the world for all the wrong reasons. \n\nRonald Reagan¡¯s presidency was relished in America for restoring the dignity of the nation soon after the Iran hostage crisis. But Reagan also gave us the gunboat diplomacy and laid down his marker in Grenada. The other Republican presidents in recent times both Bushes, also did little to enhance the image of America abroad. \n\nIn fact, it was George Bush Jr, who let the jinnee out of the bottle with the invasion of Iraq on the strength of a dodgy dossier. Iraq may have been a dictatorship under Saddam, but it was still paradise compared to what it is presently. Bush¡¯s indiscretion directly led to the creation of ISIS and the proliferation of other home-grown terrorists across the world including Boko Haram. Besides Adolf Hitler, no other leader in modern times has caused the deaths of more human being than George W. Bush. Just how that same individual is not presently before the International Criminal Court at The Hague is beyond me. \n\nBut in Donald Trump America now has a virtual disaster waiting to happen. His uncourt airs and crude remarks threaten to eclipse the poor records of the other American Republican presidents we have had in recent times. But like I wrote earlier he remains a paradox which only Americans can deal with. Let us pray that they demonstrate enough commonsense by denying Trump the stage he craves to make the world even less secure than it already is.","newsSource":"Gamji","newsTitle":"Donald Trump and the American Paradox. By Muhammad Al-Ghazali","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"d00ac281-dd12-4405-a931-b6f040e122a1","newsContent":"Disgraced former vice-president and ally of Sepp Blatter will finally be \n  punished by Fifa's ethics committee         \r \r \r \r \r\n\t\t\t\t\t\t\t\t\t\r \r Jack Warner will be banned for life by Fifa ? \r \r \r \r \r \r\n\t\t\r        \nJack Warner is finally set to be banned for life by Fifa, more than four years after quitting football. \n\n Telegraph Sport has learnt that the governing body¡¯s ethics committee is poised to announce the outcome of an investigation into Sepp Blatter¡¯s disgraced former vice-president, who is also facing criminal charges in the United States over an alleged ¡ê100 million fraud. \n\nWarner¡¯s ban would begin at the same time as Fifa¡¯s ethics committee examines evidence that could lead to the suspension of Blatter and Michel Platini over a ¡ê1.3m suspected criminal payment to the Uefa president. \n\nThe ethics committee previously chose not to pursue a case against Warner, the former president of Concacaf, because he was no longer involved in football. \n\nBut a change of policy saw it go after Trinidad and Tobago¡¯s former minister of national security, even though any ban would be merely symbolic for a man who had little prospect of returning to the game. \n \nWarner has been beset by allegations of corruption and in 2013 was found guilty by an ¡®integrity committee¡¯ of defrauding Concacaf and Fifa. \n\nHe was one of several current or former senior football officials arrested this summer over alleged fraud dating back decades. \n\n Criminal proceedings were opened against Fifa president Blatter on Friday both over the Platini payment and a television contract signed with Warner back in 2005. All three men deny any wrongdoing. \n\nBefore resigning, Warner had been a member of Fifa¡¯s executive committee since 1983 and Concacaf president since 1990. \n\n \n  A history of Fifa corruption      Cash for votes expos¨¦  October 2010     Reynald Temarii, president of the Oceania Football Confederation, is recorded telling Sunday Times reporters that two bids had offered \"huge\" payments for his support in the 2018 World Cup bidding process and that he had received offers of between $10-12 million (¡ê7.5 million). Amos Adamu, a Fifa executive committee member from Nigeria, says he wants $800,000 (¡ê500,000) to build four artificial football pitches, which contravenes Fifa's rules. Both men tell reporters they could facilitate access to the men who¡¯ll decide where the tournaments will be held. Adamu and Temarii are provisionally suspended from all football-related activity pending the outcome of an investigation. Sunday Times also exposed the referees committee, Ahongalu Fusimalohi and former executive committee member Ismael Bhamjee.     Blatter promises investigation  October 2010     Fifa president Sepp Blatter writes to all 24 executive committee members promising a full investigation into allegations. It emerges that the Spain-Portugal and Qatar bids could face expulsion from the contest for the 2018 and 2022 tournaments if the duo are found guilty of colluding. Spain-Portugal¡¯s bid leader accuses England of doing a deal with the USA in breach of Fifa regulations.     Temarii and Adamu are banned  November 2010     It is reported that the Spain-Portugal and Qatar World Cup bids could escape censure over the allegations of collusion, after Fifa executive committee member Chuck Blazer confirms that no hard evidence had been passed to its ethics committee. Adamu is suspended for three years and fined 10,000 Swiss francs (¡ê6,341) while Temarii is banned for a year and fined 5,000 Swiss francs (¡ê3,170). Panel concludes there is insufficient proof of collusion between the Spain/Portugal and Qatar bids.     Russia and Qatar win World Cup bids  December 2010     English FA is humiliated as Russia is handed 2018 World Cup finals; Qatar gets the 2022 tournament. Roger Burden, acting chairman of the FA, stands down after relations between FA and Fifa descend into acrimony. Burden said he ¡°wanted nothing more to do with them [Fifa]¡±. Swiss government prepares to investigate risk of corruption in sports bodies based in the country following Fifa¡¯s controversial award of the two World Cup finals.     Telegraph reveals Qatar corruption  January 2011   Documents seen by Telegraph Sport reveal that Qatar offered to relocate the headquarters of the Asian Football Confederation to Doha.    Evidence emerges of Qatar and Spain-Portugal collusion   February 2011   Blatter confirms that the Qatar and Spain-Portugal World Cup bids colluded to trade votes in the contest for the 2018 and 2022 finals.     FA and Fifa at loggerheads  May 2011     Geoff Thompson endorses Sepp Blatter¡¯s campaign to retain the Fifa presidency despite having been chairman of England¡¯s failed World Cup bid. Telegraph Sport discloses that England football officials hired a ¡°corporate investigations¡± company to investigate their rivals during the failed bid to host the 2018 World Cup. Six of Fifa¡¯s executive committee are accused in Parliament of ¡°improper and unethical behaviour¡± during World Cup bidding. Fifa demand the FA provide evidence to support allegations of corruption and ¡°unethical¡± behaviour against six executive committee members. Blatter vows to complete the inquiry before presidential election. The FA reveal they will hold independent inquiry into Lord Triesman¡¯s allegations of corruption against four Fifa executive committee members. The FA board agrees to abstain in the forthcoming Fifa presidential election because of doubts over the probity of both Blatter and his challenger Mohamed Bin Hammam. Qatar¡¯s 2022 World Cup bid committee accuses Parliamentary committee of ¡°insulting¡± behaviour as it launches attempted fight-back against allegations of corruption leveled against it. The FA call for the June 1 Fifa election to be postponed and for an independent review of the world governing body¡¯s structures.     Blatter runs for re-election  March 2011     Reports say the FA will support any challenger to Sepp Blatter in forthcoming Fifa presidential election. Fifa presidential challenger Mohamed Bin Hammam considers striking deal with Michel Platini that would see him step aside in favour of the Uefa president after just one four-year term if he is successful in his campaign to unseat Sepp Blatter. Blatter promises to hand out $1 billion (¡ê610,000) in ¡°development¡± funds to the 208 members associations that will decide his fate as president in the forthcoming Fifa election.     Bin Hammam and Warner are suspended  May 2011     Fifa presidential candidate Mohamed Bin Hammam says Amadou Diallo, a Guinean national accused in Parliament of facilitating bribes on behalf of Qatar¡¯s World Cup bid, is a close friend of his but not involved in any wrongdoing. Amadou Diallo, the man accused of facilitating bribes on behalf of Qatar¡¯s successful 2022 World Cup bid worked for Fifa for at least six years as an advisor to Mohamed Bin Hammam, the governing body confirms. It then emerges that Bin Hammam and Jack Warner, a Fifa vice-president, are to face disciplinary action for allegedly offering bribes to members of the Caribbean Football Union in exchange for votes in forthcoming election. Fifa's ethics committee suspend the pair from all football-related activity pending the outcome of a full inquiry into bribery accusations. Fifa general secretary Jerome Valcke confirms that an email in which he made the sensational allegation that Qatar \"bought\" the 2022 World Cup is genuine after Warner, the recipient, reveals it to the press.     Qatar dismiss bribery claims  July 2011   The whistleblower in FIFA 2022 corruption claims, Phaedra Almajid retracts her claims. Hassan Al-Thawadi, the secretary-general of the Qatar 2022 Supreme Committee, dismisses bribery claims. He then outlines the nation's plans to construct air-conditioned stadiums.     Telegraph reveals FBI investigation  December 2011   The Daily Telegraph reports that the FBI are investigating alleged hacking into email accounts for England and America¡¯s World Cup bids.     Fifa launches investigation into corruption practices  July 2012     Fifa employ American attorney Michael J. Garcia to investigate allegations of corruption in world football. A month later, Garcia declares his intention to investigate the bidding process and decision to award the 2018 and 2022 World Cups to Russia and Qatar     Blatter insists Qatar World Cup will be held in the summer  March 2013   Blatter claims that Qatar will host the World Cup in the June-July summer slot as planned, amid growing speculation it will be moved to the winter.     Fifa begins to turn on itself  July 2013     FIFA executive committee member Theo Zwanziger labels the decision to award Qatar the hosting rights of the 2022 Cup as a \"blatant mistake.\"     Blatter¡¯s admission  August 2013   Blatter confirms that that the FIFA executive committee will meet to decide on when the 2022 World Cup should be held, due to Qatar's hot climate. He admits that playing the World Cup in the summer there is \"not rational and reasonable''. Blatter goes onto say that Fifa made ¡°a mistake¡± when appointing Qatar as the host nation for the 2022 World Cup.     Fresh bribery allegations emerge  June 2014   Millions of new documents are made public by the Sunday Times, showing how bribes changed hands in order to secure Qatar the 2022 World Cup. Fifa claims it is taking the claims seriously.     Garcia report is blocked  September 2014     Garcia delivers his 350-page report, but Hans-Joachim Eckert, the head of the adjudicatory arm of FIFA's ethics committee, declares that it will not be made public for legal reasons. Instead, Eckert reveals that he will produce a summary of the report ready for public consumption by November 2014.     Eckert releases his summary and Garcia resigns  November 2014   Eckert makes public the 42-page summary of his findings after reviewing the Garcia's report. The summary clears both Russia and Qatar of any wrongdoing during the bidding for the 2018 and 2022 World Cups. Critics denounce Eckert¡¯s summary as ¡®a whitewash¡¯, while Garcia denounces it as \"materially incomplete\" with \"erroneous representations of the facts and conclusions\". FIFA's Appeal Committee then dismiss Garcia's appeal against the Eckert summary. Garcia resigns a day later, before FIFA's executive committee agree to publish a \"legally appropriate version\" of the Garcia report.     Sponsors withdraw from Fifa  January 2015     Following Sony and Emirates ending their sponsorship contracts with Fifa, Castrol, Continental and Johnson & Johnson withdraw as pressure mounts on Blatter to quit.     Blatter faces new challenger  January 2015     Prince Ali Bin Al Hussein of Jordan announces he will run against Blatter in May Fifa presidential elections. Later in the month Greg Dyke announces that his bid has the FA¡¯s support.     Telegraph reveals Warner was paid millions by Qatari firm  March 2015     Documents show that the former Fifa vice-president and his family were paid millions by a company controlled by a former Qatari football official shortly after the country won its bid for the 2022 World Cup. Warner appears to have been personally paid $1.2?million (¡ê720,000), while payments totalling almost $750,000 (¡ê450,000) were made to Mr Warner¡¯s sons. A further $400,000 (¡ê240,000) was paid to one of his employees.     It¡¯s a Winter World Cup  March 2015     Fifa confirm the Qatar World Cup will be held in November and December 2022. Premier League clubs demand compensation for the disruption.     Figo quits Fifa presidential race  May 2015     Former footballer Luis Figo withdraws from the race, due to Blatter¡¯s \"dictatorship\". He also claims to have seen incidents that \"should shame anyone who desires soccer to be free, clean and democratic\".     Fifa officials arrested in US corruption investigation  May 2015     Dawn raids see six Fifa executives arrested in Zurich, with 14 detained overall. The charges against those arrested include fraud, racketeering and money laundering and relate to World Cup bids as well as marketing and broadcast deals. Amongst those arrested are vice president of the executive committee Jeffrey Webb of the Cayman Islands, Uruguay's Eugenio Figueredo, who is also an executive committee vice president and until recently was the president of South America¡¯s football association and the notorious Warner of Trinidad and Tobago, a former member of the executive committee who has been accused of numerous ethical violations.     Blatter wins election  May 2015   Fifa proceed with presidential election despite ongoing controversies and Blatter wins a fifth consecutive term.     Blatter 'resigns'  June 2015   Four days after being elected president Blatter seems to announce his resignation with an extraordinary congress scheduled ¡°as soon as possible¡± to elect his successor. Later that month he insists he had not resigned, instead just putting himself and his office 'in the hands of the Fifa congress'.     Swiss begin criminal proceedings against Blatter  September 2015   Swiss prosecutors open criminal proceedings against Blatter regarding suspected criminal mismanagement or misappropriation over a TV rights deal he signed with former Caribbean football chief Jack Warner in 2005 as well as 'a disloyal payment' of two million Swiss Francs to Uefa president Michel Platini - his likely successor - in 20              TelegraphSportPage","newsSource":"Telegraph","newsTitle":"Fifa scandal","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"cc9e0dc0-351e-4425-bfdd-6384203600c1","newsContent":"Voice of Americas graphic \n\n Where the pope visited in Cuba  \nPope will travel\nto the U.S. \ntoday after his tour of Cuba \n\n \nBy the A.M. Costa Rica wire services \n\n \nPope Francis landed Monday in Santiago de Cuba, the last stop of his\ntour of Cuba, where he has been praised for helping to bridge ties\nbetween the Communist nation and the United States. \nThe pope visited the shrine of Cuba's patroness, the Virgin of Charity,\nbefore traveling today to Washington for the U.S. leg of his visit to\nthe two former Cold War enemies. \n\nPope Francis celebrated Mass earlier Monday in the eastern Cuban city\nof Holguin, telling tens of thousands of people to heed Jesus Christ's\ninvitation to overcome resistance to change. \n\nDuring his homily, Pope Francis said Christ challenges the faithful\ndaily to believe in the possibility of personal transformation. \"He\ninvites us slowly to overcome our preconceptions and our reluctance to\nthink that others, much less ourselves, can change,\" he said. \n\nHolguin, Cuba's third-largest city, has been a cradle of the Catholic\nfaith on the island and is known for a cross that has overlooked the\ntown for centuries.? It is also the home region of Communist\nleaders Fidel and Ra¨²l Castro, who have ruled Cuba since 1959. \n\nPope Francis met with the brothers in Havana at the start of his Cuban\ntrip. \n\nDuring his homily, Pope Francis said Christ challenges the faithful\ndaily to believe in the possibility of personal transformation. \"He\ninvites us slowly to overcome our preconceptions and our reluctance to\nthink that others, much less ourselves, can change,\" he said. \n\nMeanwhile, several leading dissidents have criticized the pope for not\naccepting their requests to meet him during his visit. \n\nThe head of the opposition group Ladies in White said 22 of 24 members\nof her group who wanted to attend Sunday's Mass were prevented from\ngoing by Cuban security agents. \n\nAnd two other well-known Cuban dissidents told The Associated Press\nthat agents detained them after the Vatican invited them to the pope's\nvespers service at Havana's cathedral. \n\nMarta Beatriz Roque and Miriam Leiva said they received invitations\nfrom the office of the papal ambassador in Havana but said they were\narrested as they tried to travel to the cathedral. \n\nVatican spokesman Federico Lombardi said that some dissidents were\ninvited to events to receive a greeting from the pope but that he\ndidn't know why the greeting didn't take place. \n\nAsked if the Holy See would lodge an official protest, Lombardi\ndemurred, saying it was a passing greeting, not an official meeting. \n\nThe dissident Cuban Commission for Human Rights and National\nReconciliation estimated 50 dissidents were detained and prevented from\nattending papal events, with most released within a few hours. \n\nBut the Patriotic Union of Cuba, the country¡¯s largest dissident group,\nsaid four of its activists remained in jail as of late Sunday. Those\nfour had attempted to deliver a letter to the pope, one of whom got\nclose enough to make contact with Francis in his popemobile,? Jose\nDaniel Ferrer, the group's leader, said. \n\n \nVoice of America/ M. Bush \n\n Pope Francis memorabilia is\nfront and center in the gift shop at the Basilica of the National\nShrine of the Immaculate Conception in Washington, D.C. \nNational\nShrine being readied \nfor first canonization Mass \n\n \n \nBy the A.M. Costa Rica wire services \n\n \nJust a few days before Pope Francis arrives in Washington, preparations\nfor the first canonization Mass in the United States are well underway. \nAt the Basilica of the National Shrine of the Immaculate Conception,\nCardinal Donald Wuerl toured the site to check on the progress. \n\n¡°When we come here next we¡¯re going to be surrounded by over 25,000\npeople just to see and pray with our Holy Father,\" he told reporters. \n\nAnd competition for those seats is fierce. \n\n\"This is one of the largest Catholic churches in the world, and it\ncan¡¯t hold the number of people who want to be there,\" he explained. \n\nIt will be a mass of firsts. \n\n\"This Holy Father is the first Pope from the New World. He¡¯s coming for\nthe first time to the United States to do for the first time, a\ncanonization,\" Cardinal Wuerl said. Becoming a saint is Junipero Serra,\nthe founder of California missions. \n\nAnd in the Basilica gift shop, there are any number of ways to remember\nthat moment. \n\n¡°It¡¯s hard to wrap my head around the fact that the Pope is coming\nhere,\" admitted Basilica gift shop employee Angela Devanadera. \n\n¡°Hopefully everything will be in place and ready to go,¡± she added\nconfidently. \n\nHusband of jailed spouse \nwill protest during visit by Xi \n\nBy the A.M. Costa Rica wire services \n\n \nWith Chinese President Xi Jinping making a state visit to the United\nStates, a man in the southern U.S. city of Houston is using the\noccasion to call attention to the case of his wife who has been\ndetained in China for the past six months on allegations of spying and\nstealing state secrets. \nJeff Gillis said that Chinese authorities detained his wife, Sandy\nPhan-Gillis, an American citizen of Chinese descent, March 19 in\nGuangzhou while visiting with a group of Houston officials and\nChinese-American businessmen. \n\nShe has not been formally charged with any crime and was moved Sunday\nto a facility in Nanning. \n\nGillis said he does not know of anything illegal his wife did while in\nChina. \n\n\"I can't think of any reason why the Chinese government would have done\nthis,\" he said. \n\nHe said that U.S. consular officials visited his wife in Guangzhou and\ndetermined she was not being mistreated. \n\nGillis wanted to keep the case a low-profile matter in hopes it could\nbe resolved, but became discouraged as months passed and he got what he\nfelt was a cool reaction by the U.S. State Department. \n\nWith Xi's trip, he sees an opportunity to use the state visit to get\npublic support for his wife's case. \n\nXi will be in Seattle beginning today, and Gillis said he and some\nrelatives are considering staging a demonstration to coincide with the\nleader's visit. \n\nScott Walker removes himself \nfrom the presidential race \n\nBy the A.M. Costa Rica wire services \n\n \nRepublican Scott Walker has suspended his U.S. presidential campaign,\neffectively ending an eight-week formal push that saw him sink from\nnear-frontrunner status to political insignificance in the key campaign\nstate of Iowa. \nAnalysts and insiders attributed the Wisconsin governor's decision to a\nlack of funding, as he crisscrossed Iowa and sought support for the\nRepublican nomination in other key states seen as favoring his\nconservative message. \n\nBut Monday Walker said he had become disillusioned with the Republican\nrace, and that the overall campaign had drifted into personal attacks.\nHe did not offer details. But in a thinly veiled swipe at leading\ncandidate Donald Trump, Walker called on the remaining candidates to\ndevelop \"a positive, conservative alternative to the current\nfrontrunner.\" \n\nWalker gained national attention in 2012, after his successful push to\ndecertify public worker unions in his home state, and later for\nsurviving a recall election largely organized and backed by disgruntled\npublic workers and their supporters. But his campaign, launched in\nJuly, failed to gain traction nationally, and several recent surveys\nshowed him favored by fewer than 5 percent of likely voters in Iowa. \n\nIn other developments, a U.S.-based Islamic civil liberties group on\nMonday called for one of the leading Republican candidates, former\nneurosurgeon Ben Carson, to quit his campaign after he said he would\nnever support a Muslim presidential candidate. \n\nNihad Awad, executive director of the Council on American-Islamic\nRelations, said that Carson, a devout Christian, should withdraw\n\"because he's unfit to lead because his views are in contradiction with\nthe United States Constitution.\" \n\nAwad noted that the Constitution says \"no religious test shall ever be\nrequired as a qualification\" for U.S. public office. \n\n\"This cannot be misunderstood. This is a very clear language to all\nAmericans, to all generations, irrespective of who they are,\" Awad said\nat a news conference. \n\nCarson told NBC's \"Meet the Press\" Sunday, \"I would not advocate that\nwe put a Muslim in charge of this nation. I absolutely would not agree\nwith that.\" \n\nHe said a president's faith should matter to voters and he described\nthe Islamic faith as inconsistent with the U.S. Constitution, although\nhe did not specify in which way Islam runs counter to constitutional\nprinciples. \n\nCarson's comments came amid lingering fallout over Republican Donald\nTrump's refusal last week to take issue with a man who, during a New\nHampshire campaign event, wrongly called President Barack Obama a\nMuslim and said Muslims are \"a problem in this country.\" \n\nNever too late is slogan \nfor Senior Games athletes \n\nBy the A.M. Costa Rica wire services \n\n \nEvery morning, Tony Diamond goes to a local park for an hour of fast\nwalking. Then he runs for another hour. He also goes to a gym two or\nthree times a week for muscle training. The retired navy captain won\nthree medals at the 2015 National Senior Games in the road race and the\nrace walk in his age group, 85 to 89. \n¡°My current age is 86 years old, and my fitness age is 44,\" he says. ¡°I\nthink I have such a good number because I did a lot of exercise during\nmy life. I've been exercising since I was a little boy.¡± \n\nHelen White, a versatile athlete who won a silver medal in pickleball\nat the 2013 National Senior Games, plays basketball and also teaches\nthe sport to senior groups. \n\n¡°I'm 62 years old and my fitness result showed that I was 32 years,\"\nshe says. ¡°It really wasn¡¯t until I turned to 50 that I decided to\nbecome much more serious and focused about play, and just making sure\nit is daily part of my life.¡± \n\nMs. White and Diamond are among some 5,000 competitors in the National\nSenior Games, a biennial competition for athletes over 50 that was\nrecently held in Minnesota, who took part in the study on fitness age. \n\nThe research, led by Pamela Peeke of the University of Maryland in\ncoordination with Ulrik Wisloff of the Norwegian University of Science\nand Technology, who developed a fitness calculator, found that older\nathletes¡¯ fitness age is more than 20 years younger than their\nchronological age. \n\n¡°You simply input very straightforward data,\" said Dr. Peeke,\nexplaining how the study was conducted. \"We ask you questions","newsSource":"A.M. Costa Rica","newsTitle":"Legislature agrees to borrow $48 million for Sardinal","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"4662e6ab-0053-4a72-88fb-c6e190882e1e","newsContent":"Marco Rubio has no shortage of problems with the way President Obama has conducted his foreign policy. \n\nThe Florida senator and GOP presidential candidate says the Obama administration left \"chaos\" behind in the Middle East after withdrawing troops from Iraq in 2011. In an interview with NPR's Steve Inskeep, Rubio says that Russia has gained leverage from the perception that the United States abandoned the region. \n\nRussia has been sending heavy equipment ¡ª including warplanes ¡ª and troops into Syria. Iraq also announced an intelligence-sharing arrangement with Moscow over the weekend in the fight against ISIS. \n\nRubio says the United States has failed to be a reliable ally to countries in the region battling ISIS. Therefore, he says, \"If left with a choice between Russia and nothing, they're going to choose Russia.\" \n\nThe U.S. has led an air campaign against ISIS in Iraq and Syria, backed by Western and Arab allies. But efforts to mount a ground force to battle the extremists, or hold territory cleared by airstrikes, have flagged. \n\nRubio has also pledged to scrap the nuclear deal with Iran, if elected, on his first day in office. He does not believe Iran will stick to the deal, despite assurances by Iranian President Hassan Rouhani in an NPR interview this weekend that his country has a \"religious obligation\" to do so. \n\nRouhani said statements by Rubio and other GOP presidential candidates that they would like to terminate the deal fuel skepticism in Iran that the U.S. will keep its promises. \n\nRubio predicts that Iran will eventually claim technicalities to \"erode the deal's restrictions on them.\" Rubio adds, \"They'll challenge them, they'll gamble that the West and the United States has so much invested in the success of this deal that we will tolerate those violations.\" \n\nThe nuclear deal was secured on Capitol Hill despite strong opposition from Rubio and other Republicans, who control both the House and Senate. \n\nIn the wake of House Speaker John Boehner's surprise resignation, which Rubio announced to cheers at a conference of social conservatives in Washington on Friday, Rubio says of the frustration with the GOP establishment, \"It's very real.\" \n\n\"We know people are upset that they elected a Republican-majority Senate, have a Republican-majority House, and yet they seem incapable of getting anything done,\" Rubio says. \n\nConservatives in Congress are likely facing another disappointment this week, as the GOP leadership appears capable of keeping the government funded past a Sept. 30 deadline, without stripping federal money for Planned Parenthood. \n\nRubio says the Republican establishment gave up in the fight against Planned Parenthood, which was sparked by a series of sting videos against the organization that provides a range of health services, including abortions. \"They didn't think they could win the public debate, and so they never even tried,\" he tells NPR. \n\nAttacking the party establishment appears to be smart politics in a campaign season when political outsiders have captured the energy in the presidential race. \n\nRubio has been in politics since he won a seat on the West Miami City Commission in 1998. He then rose through the ranks of Florida's state Legislature, eventually taking the mantle of speaker in the state House of Representatives, before being elected to the U.S. Senate in 2010 with the backing of the Tea Party. \n\nRubio has picked up steam recently in the presidential race, both in polls and by inheriting key campaign resources from Wisconsin Gov. Scott Walker, who dropped out of the race last week. \n\nPerhaps there's no clearer sign that Rubio is performing better than the fact that he's come under attack by Donald Trump. In a pair of cable TV interviews last week, Trump called Rubio a \"kid\" and mocked him for getting \"sweaty\" during the last GOP debate, where several candidates complained of the heat on stage. \n\nSince then, the two candidates have been engaged in a tit-for-tat. Rubio responded by saying that Trump is \"touchy and insecure\" in an interview with Kentucky Sports Radio on Thursday. \n\nAt the Values Voter Summit in Washington on Friday, Trump called Rubio a \"clown\" ¡ª drawing sustained boos from the crowd of social conservatives. \n\nIn response, Rubio tells NPR, \"I'm not interested in the back and forth.\" He then went on to further his criticism of Trump, referring to his presence in the race as a \"freak show.\" \n\n\"[Trump] is a very sensitive person. He doesn't like to be criticized. He responds to criticism very poorly,\" Rubio says. \"His poll numbers have taken a beating, and he was embarrassed on national television at the debate by Carly Fiorina and others.\" \n\n\"But this election is not going to be about Donald Trump,\" Rubio adds. \"He thinks it is, but it's not about him. It has to be about the issues confronting our country. And my sense of it is that every time issues become prominent, he will say something outrageous or do something outrageous so that he doesn't have to talk about the issues.\"","newsSource":"KUNC 91.5 FM","newsTitle":"Sen. Marco Rubio","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"ef96951c-3c00-4336-861a-03d4dd0633eb","newsContent":"Wednesday Column By Olalekan Waheed Adigun\n\n \n\nBefore the Nigerian presidential election early this year the Peoples Democratic Party PDP supporters were so full of confidence of their abilities to ¡°deliver¡± Their deluded confidence only made them depended on their so-called ¡°Incumbency advantage¡± to save their party from a shameful defeat Some of them on the pages of newspapers spoke even more confidently of their party¡¯s victory as a done deal a confidence even President Jonathan himself never had It only required Nigerians to go to the polls on March 28 for some of these men and their women too to wake up from their slumber We are still waiting for some to honour their words The lousiest among them had said that they will relocate elsewhere should the All Progressives Candidate APC General Muhammadu Buhari ever wins Another still threatened to ¡°shut down the country¡± should the APC win More indecorously one of them said Buhari will not last in office due to his ¡°poor health¡± I can bet Buhari at 72 is healthier than this fellow who in my opinion needs an urgent medical attention The rest as they say is history\n\n \n\nMany thoughts have been shared about the ¡°great fall¡± of the PDP How the mighty fall It only reminds me of the movie by the American rapper Curtis Jackson 50 Cents Before I Self-Destruct a crime drama movie which ended in him getting himself destroyed in the process of getting a revenge for the accidental shooting of his mother Does this have anything to do with ¡°our great party¡±\n\n \n\nGreat civilisations are born start to grow they reach the peak of their powers decline and ultimately crumble We often hear of the great Zimbabwe great Timbuktu Egypt Babylon Carthage Rome Ottoman Macedonia and the likes were all great civilisations at different times Since nothing good or bad lasts forever there came a time when they have to erode with history This is why I love the most quoted Igbo saying ¡°No human condition is permanent¡± There is time as King Solomon said to everything under the sun The only problem here is that unlike the Sons of Issachar the PDP supporters fail to recognise how fast the ¡°times and seasons¡± have changed Are they still wondering why the world crumbled under their feet\n\n \n\nThe PDP perhaps did not realise its ¡°humanness¡± at all In 2008 Chief Vincent Ogbulafor its then National Chairman had publicly boasted that the party will rule Nigeria for the next sixty years At other points some of its leaders echoed arrogantly that it will rule forever Maybe this was why the party did not prepare for its recent shock electoral defeat How painful it can be to be caught guards down\n\n \n\nIt is never easy to be in opposition after losing your ¡°daily bread¡± It is never made easier when you are beaten to your own game In opposition you operate largely on lean budgets and more often than not you are under suspicions and investigations This appears to be the fear of the party today It is scared of everything including itself This is not the time for the PDP strategists to go to sleep The party will not be the first to find itself in this kind of position neither will it be the last Was this why the APC Publicity secretary Alhaji Lai Muhammed ¡°offered¡± his PDP counterpart Chief Olisa Metuh ¡°a free 6 weeks crash course¡± on how to be an opposition spokesman\n\n \n\nThe United Kingdom UK Conservative Party had to weather the storm of turbulent period of fifteen years after since Labour Party¡¯s Tony Blair won in 1995 You can only imagine the Tories¡¯ frustrations during those years before David Cameron won in 2010 You may also understand how the Fabians must have felt having to wait for 21 uninterrupted years including ¡°Iron Lady¡± Margaret Thatcher¡¯s 11-year stint as Tory Prime Minister\n\n \n\nThe Mexican Partido Revolutionario Institucional or the Institutional Revolutionary Party PRI held on to power for uninterrupted 71 years since 1929 winning every presidential elections Though some critics point out that it won the 1988 and 1994 elections by fraudulent ballots the party never lost a national election till 2000 when it relinquish power peacefully It had to wait another twelve years to return to power at the national level in 2012\n\n \n\nThe United States US Republicans had to cope with serial electoral defeats since losing the Presidency to Franklin D Roosevelt in 1936 At some point their membership in the Senate reduced to less than 30 during this period The Grand Old Party GOP had to wait till 1952 to get back to the White House\n\n \n\nThe PDP does not appear to be prepared for the daunting challenge of becoming an opposition party The present crises rocking the party over the control of its leadership should be a cause for concern to its rank and file It is just that they are not admitting it openly opposition in can be a unique experience You are almost an endangered species if you are in opposition you are constantly harassed suspected or intimidated and there is no question of ¡°Loyal Opposition¡±\n\n \n\nIt is now an open secret that the all is not well within the party¡¯s ranks There are insinuations that some of its governors with tacit support of former President Goodluck Jonathan are planning to float a new platform to challenge the All Progressives Congress APC This appears to me more like a mistrust of brand The party¡¯s brand has been seriously battered by corruption impunity ineptitude and mediocrity The future is looking rather gloomy by the day for PDP\n\n \n\nJust recently the immediate past PDP National Chairman Alhaji Adamu Muazu is recently reported to be nursing Presidential ambition in 2019 and hence planning to form a new party expressly for that purpose Many were made to believe that PDP¡¯s problems will be all over by just getting rid of Muazu as its Chairman but were all to be proven wrong\n\n \n\nImmediately after the presidential election no less a person than the Ekiti State Governor Ayo Fayose made serious allegations Muazu as engaging in ¡°anti-party¡± activities during the election Among other things the Governor made the allegation that Muazu actually met with some APC leaders with the view to ¡°selling the PDP¡± to the APC\n\n \n\nWhile this writer is not privy to the inner workings of the PDP we must never loose sights of certain facts that are now to public knowledge If General Buhari¡¯s strategists must have some people to be grateful for on their victory in the March election it has to be Ayo Fayose and Femi Fani-Kayode for poor understanding and handling of PDP¡¯s public relations and their embarrassing displays during the presidential campaigns What better ally does one need than these two in a presidential campaign\n\n \n\nAs a matter of recommendation if the party¡¯s strategists are working they must look for ways to create a new image or brand for the party which will pave ways for new orientation new directions and corporate culture The party¡¯s brand has been utterly battered for many years been associated with impunity corruption and mediocrity This the party must do except it want to self-destruct\n\n  Waheed Adigun is accessible at olalekanolalekanadiguncom adgorwellgmailcom adgorwell","newsSource":"Uncova","newsTitle":"Before they self-destruct!","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"f815c789-f621-4f0d-863b-bba783f12ed9","newsContent":"? Republican presidential frontrunner Donald Trump stepped into the Hot Box in Wednesday¡¯s debate as rivals turned their sights on him, and Carly Fiorina showed she had earned her place on the main stage. \n \n10 challengers flanked Mr. Trump on the platform at the Ronald Reagan Presidential Library in Simi Valley, California, seeking an opening against the man who has defied all political odds to lead the race for the party¡¯s nomination ahead of the November 2016 election. \n \nAs one after the other took their shots at him Mr. Trump swiftly returned fire, further imposing himself on the race to determine who will battle the Democratic nominee, likely Hillary Clinton, for the White House next November. \n \nThe remarks near the top of the 3-hour debate kicked off several minutes of Trump-related thrusts and parries that have defined much of the 2016 presidential race. \n \nDonald Trump was at once strong, forthright and happily charming to all commers. \n \nFallen frontrunner Jeb Bush was under intense pressure to deliver a breakout performance, or risk a campaign meltdown that could see them shunted aside as the 1st state nomination votes in February draw nearer. Jeb Bush¡¯s body language revealed that he was nervous, and struggling to defend his possitions, record, and family members, including his father and brother, both former presidents. \n \nMs. Fiorina, the sole woman in the Republican race and the only candidate to rise from last month¡¯s ¡°childrens hour¡± debate to Wednesday¡¯s main stage, delivered a trained bbut unleashed bulldog like coached performance, spouting memorized facts about Key issues. We all know that her business record is not sterling, and that after she was fired from HP, she ran for the Senate against Barbara Boxer (D) in California and was beaten by a landslide. Carley is not Presidential. \n \nDonald Trump disaarmed her by saying, ¡°I think she¡¯s got a beautiful face, and I think she¡¯s a beautiful woman.¡± \n \nThe main event¡¯s 11 candidates clashed extensively on issues including immigration, how to handle a looming government shutdown, and dealing with Russian President Vladimir Putin. \n \nJeb Bush the ultimate establishment Republican, has seen his political fortunes dive in the months since Donald Trump entered the race. \n \nThe former Florida governor fenced with with Mr. Trump over speaking Spanish in the United States. \n \nAsked what he would want his Secret Service handle to be if he were elected, Jeb Bush said ¡°Ever-ready. It¡¯s very high-energy, Donald.¡± Again, Mr. Bush was not really assertive with his corny retort. \n \nJeb Bush was forced into an awkward defense of his brother George W. Bush, who was president on September 11, 2001 and launched divisive wars in Afghanistan and Iraq after the terror attacks on American soil in retaliation to threats against his father by former US allies. \n \n¡°There is one thing I know for sure, he kept us safe,¡± Jeb Bush said. \n \n¡°I don¡¯t know, do you feel safe right now?¡± Donald Trump replied. ¡°I don¡¯t feel so safe.¡± Jeb Bush shrunk, the audience cringed. \n \nThe Bush name is not a benefit in American politics anylonger. \n \nHis mother said not long ago she was not happy about him runnng for President, we are seeing why. \n \nWe now clearly know that the media is behind Donald Trump, he was given the lions share of the time duning the debate at 18 mins. Soon we shall see the low polling canidates dropping out because thier money is drying up. \n \nTrumpeting for Trump \n \nPaul Ebeling \n \nHeffX-LT \n The following two tabs change content below.       \nPaul Ebeling is best known for his work as writer and publisher of ¡°The Red Roadmaster¡¯s Technical Report¡± on the US Major Market Indices?, a highly-regarded, weekly financial market letter, where he enjoys an international audience among opinion makers, business leaders, and respected organizations.\r\n\r\nSomething of a pioneer in online stock market and commodities discussion and analysis, Ebeling has been online since 1994.  He has studied and worked in the global financial and stock markets since 1984. \n         \nTrade FX, Equities and Options with the World's Leading Platform Open an account here , call us at 305 4904 116, or email us to get started.","newsSource":"Live Trading News","newsTitle":"Donald Trump Turns Up The Heat In 2nd GOP Debate","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"0cbc073b-f9bc-42f1-a06c-6a0f966d2c5f","newsContent":"Published 09/17/2015                    \n                \n                \n                    by  \nSimi Valley (United States) (AFP) \n\nTen challengers flanked Trump on stage at the Ronald Reagan Presidential Library in California, seeking an opening against the man who has defied all political odds to lead the race for the party's nomination ahead of the November 2016 election. \n\n\"Mr. Trump, we don't need an apprentice in the White House, we have one right now,\" Wisconsin Governor Scott Walker told Trump -- a snarky reference to the title of the real estate mogul's reality television show. \n\nTrump swiftly returned fire, living up to his billing as the campaign bulldog by attacking his rivals, further imposing himself on the race to determine who will battle the Democratic nominee, likely Hillary Clinton, for the White House. \n\nAFP / Frederic J Brown \nCarly Fiorina, the former chief executive of Hewlett-Packard, delivered a withering response to insulting comments about her looks that Donald Trump made in a recent magazine interview \n\n\"In Wisconsin I went to number one, and you went down the tubes,\" Trump retorted, highlighting Walker's slumping poll numbers. \n\nThe remarks near the top of the marathon three-hour debate kicked off several minutes of Trump-related thrusts and parries that have so far defined much of the 2016 presidential race. \n\nMany, like early presumptive frontrunner Jeb Bush, were under intense pressure to deliver a breakout performance -- or risk a campaign meltdown that could see them shunted aside as the first state nomination votes in February draw nearer. \n\n- Fiorina confident - \n\nFiorina, the sole woman in the Republican race and the only candidate to rise from last month's \"undercard\" debate to Wednesday's main stage, delivered by many accounts a command performance. \n\nThe former chief executive of Hewlett-Packard offered passionate calls for defunding women's health care provider Planned Parenthood, a publicly funded organization that offers abortions. \n\nAFP / Frederic J Brown \nRepublican presidential hopefuls George Pataki (L), Rick Santorum (C) and Rand Paul arrive for the Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California, September 16, 2015 \n\nShe also delivered a withering response to Trump's insulting comments about her looks that he made in a recent magazine interview. \n\n\"I think women all over this country heard very clearly what Mr. Trump said,\" she said, offering him a cold stare and earning loud applause. \n\nTrump, in a rare concession, replied","newsSource":"Look Local","newsTitle":"Trump targeted, Fiorina shines in US Republican debate","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"59d5e8b7-682a-4b6c-8d94-f3c4c946bfe2","newsContent":"By (Reuters) - Republican Governor Scott Walker of Wisconsin abruptly pulled out of the 2016 U.S. presidential race on Monday, doomed by a lightning-quick collapse from serious contender to a candidate struggling to raise money and his profile. Walker, reading a statement in the Wisconsin capital of Madison, decried the negative tone of the Republican campaign in remarks seemingly directed at New York billionaire Donald Trump. He called on some of his rivals for the Republican nomination to join him in exiting the race to give voters a chance to rally around a front-runner that can win the November 2016 presidential election. Walker harked back to the late Republican President Ronald Reagan as a model for the party because \"he was an optimist.\" \"Sadly the debate taking place in the Republican Party today is not focussed on that optimistic view of America. Instead it has drifted into personal attacks,\" he said. \"In the end I believe that the voters want to be for something and not against someone. Instead of talking about how bad things are, we want to hear how they can make them better for everyone. We need to get back to the basics of our party,\" he said. Walker's fall was dramatic and swift. He electrified conservatives in Iowa in January by promoting his record in Wisconsin of having beaten back public unions and survived a recall election. When he officially announced his campaign in early July, he was among the leaders for the Republican nomination. But the 47-year-old governor quickly struggled on the campaign trail despite a strong conservative record and a warm personal story as a Harley motorcycle aficionado. Walker's lack of experience on the national stage was apparent. He gave shifting answers to questions about illegal immigration and once suggested a wall between the United States and close ally Canada might be in order, in an apparent effort to double down on rivals' calls for a wall on the Mexican border. He did not do much to reassure supporters with lacklustre performances in the first two Republican presidential debates. Walker's struggle for traction, combined with the rise of Trump, took its toll. A CNN/ORC poll released on Sunday gave him less than 1 percent support among Republican voters. In a recent Reuters/Ipsos poll of the Republican field, he received 3 percent of support. In an initial sign of trouble, Walker last week cancelled events in California and Michigan to concentrate on Iowa, the key early voting state that shares a border with Wisconsin. In recent days, he had vowed to focus solely on Iowa. Walker will be the second Republican to drop out of the race. He follows former Texas Governor Rick Perry, who dropped out on Sept. 11. For more on the 2016 presidential race, see the Reuters blog, ¡°Tales from the Trail¡± (http","newsSource":"Sharenet","newsTitle":"Republican Walker exits 2016 U.S. presidential race","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
{"newsId":"3caec793-14e0-4b19-9f98-7a862259c872","newsContent":"(CNN) -  \nThe leading Muslim civil liberties group in America called Monday for Republican Ben Carson to drop out of the presidential race after the retired neurosurgeon said this weekend that he doesn't believe any Muslim should be president of the United States. \n \nNihad Awad, executive director of the Council on American-Islamic Relations, said the group is calling on Carson to \"withdraw from the presidential race because he is unfit to lead, because his views are inconsistent with the United States Constitution.\" \n\nCarson said Sunday on NBC's \"Meet the Press\" that he \"would not advocate that we put a Muslim in charge of this nation. I absolutely would not agree with that.\" He said he believed that Islam was \"inconsistent with the values and principles of America\" and inconsistent with the U.S. Constitution. \n\nCarson is currently a top contender for the GOP presidential nomination, taking third place with 14% of support in the latest CNN/ORC poll, released Sunday. \n\nHis comments came as he responded to another controversy involving a GOP presidential candidate and Muslims in America when a questioner told Donald Trump at a campaign event in New Hampshire that \"we have a problem in this country ... called Muslims\" and said that President Barack Obama is a Muslim. \n\nAwad insisted that it was Carson's, not Muslim Americans', views that are inconsistent with the Constitution, as the document states that there shall be \"no religious test\" for candidates seeking public office. \n\nAwad said he was \"shocked\" to hear Carson's comments, which he described as \"anti-Muslim.\" He urged the public and other presidential candidates to \"repudiate\" Carson's views. \n\n\"The protection of freedom of religion in America is a fundamental principle of our country so whether you are Christian, you are Jewish, you are Muslim, you are Catholic, you are black, you are brown, you are white -- if you are born in this country, if you uphold Constitution, if you have the vision, if you are fit to lead, you can lead irrespective of your faith tradition,\" Awad said. \n\nImmediately following Awad's comments, Carson's business manager, Armstrong Williams, told CNN that Carson was not trying to \"hurt or offend\" but came to his conclusion about Islam \"because of his love for America.\" \n\n\"What an individual believes impacts how America is governed and what we become as a nation,\" Williams said, adding that Carson is not alone in his view of Islam. \n\nIn fact, according to a Gallup survey published in June, 38% of Americans polled said they would not support a Muslim candidate for president, while 60% said they would. \n\n\"There are many Americans, if they search their hearts, they believe the same thing -- they don't want to believe it but when they look at the world and look at how Islam has become polluted and what is happening in Europe and in the Middle East and around the world, you have to take time to pause and ask what is happening around the world?\" Williams said. \n\nWilliams also slammed what he called the \"destructive tenets of Islam and Sharia law.\" \n\nDemocratic front-runner Hillary Clinton tweeted a brief question and answer Monday","newsSource":"KEYT3","newsTitle":"Muslim-American group calls on Carson to drop out","mediaType":"News","newsDate":"2016-09-04 21:44:25.0"
}
