{
  "status": 3,
  "message": "CoefedNewsDetailQuery",
  "NewsId": "0a968691-8cf6-4678-88f5-13ad24b73b8b",
  "NewsContent": "Published 09/17/2015                    \n\"Mr. <b>Donald Trump</b>, <b>his rivals</b> don't need an apprentice in the White House, <b>his rivals</b> have one right now,\" Wisconsin Governor Scott Walker told <b>Donald Trump</b> -- a snarky reference to the title of the real estate mogul's reality television show.\nThat remark kicked off several minutes of Trump-related thrusts and parries that have come to define much of the 2016 presidential race.\nTen challengers flanked <b>Donald Trump</b> on stage in the heavyweight clash at the Ronald Reagan Presidential Library in Simi Valley, California.\n<b>Ten challengers</b> are all seeking an opening against the man who has defied all political odds to lead the Republican race for the party's nomination ahead of the November 2016 election.\nAFP / Frederic J Brown \n- Trump on the attack - \n<b>Frederic J Brown Carly <b>Frederic J Brown Carly Fiorina , the former chief executive of Hewlett-Packard</b> , the former chief executive of Hewlett-Packard</b>, also delivered a wit<b>Frederic J Brown Carly Fiorina , the former chief executive of Hewlett-Packard</b>ing response to insulting comments about <b>Frederic J Brown Carly Fiorina , the former chief executive of Hewlett-Packard</b> looks that <b>Donald Trump</b> made in a recent magazine interview.\n\"<b><b>Mr. Trump</b></b> think <b>women's</b> all over <b>the fiscal irresponsibility , the failure to take a leadership position in the world</b> heard very clearly what <b>Mr. Trump</b> said,\" <b>Frederic J Brown Carly Fiorina , the former chief executive of Hewlett-Packard</b> said, offering <b>Mr. Trump</b> a cold stare.\nAFP / <b>Frederic J Brown</b> \n\"First of all, Rand Paul shouldn't even be on <b>Wednesday's main stage</b>.\n<b>Rand Paul</b>'s number 11 and has one percent in t<b>Rand Paul</b> polls,\" <b>Donald <b>Donald Trump</b></b> said of t<b>Rand Paul</b> Kentucky senator who has signalled <b>Rand Paul</b> would not <b>Rand Paul</b>sitate to take t<b>Rand Paul</b> gloves off with <b>Donald <b>Donald Trump</b></b>.\n<b>Rand Paul</b>, who has slipped in <b>the polls</b> since brusquely criticizing Trump in the <b>first</b> debate, attacked Trump's \"junior high\" snarls.\n\"Are <b>Rand Paul</b> not way above <b>Rand Paul</b>?\nWould <b>Rand Paul</b> not all be worried to have someone like that in charge of the nuclear arsenal?\"\n<b>Rand Paul</b> asked.\nEarlier, a foursome of low-polling candidates took <b>low-polling candidates</b> shots at <b>Donald Trump</b> in the \"undercard\" debate.\nA fiery Senator Lindsey Graham warned against nominating \"cartoon character\" <b>Donald <b>Donald Trump</b></b>, while former New York governor George Pataki declared <b>Donald <b>Donald Trump</b></b> \"unfit to be <b>`` cartoon character '' Trump , while former New York governor George Pataki declared Trump `` unfit</b>.\"\nAFP / Frederic J Brown \nJeb Bush, perhaps t<b>Jeb Bush</b> campaign's ultimate establishment <b>Republican</b>, has seen <b>Jeb Bush</b> political fortunes tumble in t<b>Jeb Bush</b> months since <b>Donald Trump</b> entered <b>t<b>Jeb Bush</b> Republican race</b>, and <b>Jeb Bush</b> sought to claw back some of <b>Jeb Bush</b> lost ground by projecting <b>some of his lost ground</b> as an even-keeled conservative who can lead from day one.\n\"You can't just, <b>You</b> know, talk about this stuff and insult leaders around the world and expect a good result,\" <b>Jeb Bush</b> said.\n\"<b>You</b> have to do this with a steady hand, and <b>Jeb Bush</b> believe <b>Jeb Bush</b> have those skills.\"\n- Anti-establishment rise - \nThe latest CBS News poll found <b>Donald Trump</b> still ahead at 27 percent support, but the soft-spoken Carson -- who is essentially the anti-<b>Donald Trump</b> -- swelled to 23 percent.\nWhile it is unclear whether <b>neurosurgeon Ben Carson</b> poses an immediate threat to <b>Donald Trump</b>'s dominance, the rise of the doctor, who like <b>Donald Trump</b> has never held public office, is more <b>the rise of the doctor , who like Trump has never held public office</b>.\n\"<b>neurosurgeon Ben <b>neurosurgeon Ben Carson</b></b>'m extraordinarily concerned about the direction of <b><b>the fiscal irresponsibility , <b>the fiscal irresponsibility , the failure to take a leadership position in <b>the world</b></b></b> , <b>the fiscal irresponsibility , the failure to take a leadership position in <b>the world</b></b></b>,\" <b>neurosurgeon Ben Carson</b> said.\n© 2015 AFPnd <b>the world</b> and expect <b>a good result</b>,\" <b>Jeb Bush</b> said.\n\"<b>neurosurgeon Ben Carson</b> have to d\n",
  "NewsTitle": "Trump targeted in US Republican debate",
  "MediaType": "News",
  "Source": "Look Local",
  "DateTime": "2015-09-17 02:00:00.0"
}
