{
  "status":1,
  "message":" NewsDetailQuery",
  "NewsId":"0a968691-8cf6-4678-88f5-13ad24b73b8b",
  "NewsContent":"Published 09/17/2015                    \n                \n                \n                    by  \nSimi <b>Valley</b> (United States) (AFP) \n\nTrump swiftly returned fire, living up to his billing as the campaign bulldog by attacking his rivals, further imposing himself on the race to determine who will go up against the Democratic nominee, likely Hillary Clinton. \n\n\"Mr. Trump, we don't need an <b>apprentice</b> in the White House, we have one right now,\" Wisconsin Governor Scott Walker told Trump -- a snarky reference to the title of the real estate mogul's reality television show. \n\nThat remark kicked off several minutes of Trump-related thrusts and parries that have come to define much of the 2016 presidential race. \n\nTen challengers flanked Trump on <b>stage</b> in the heavyweight clash at the<b> Ronald</b> Reagan Presidential Library in Simi Valley, California. \n\nThey are all seeking an opening against the man who has defied all political odds to lead the Republican race for the party's nomination ahead of the November 2016 election. \n\nAFP / Frederic J Brown \nRepublican presidential hopefuls Ben Carson (L) and Donald Trump talk before the Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California, September 16, 2015 \n\nMany are under intense pressure to deliver a breakout performance that would help separate them from the large pack of candidates vying for the White House -- or risk a campaign meltdown that could see them shunted to the side as the first state nomination votes in February draw nearer. \n\n- Trump on the attack - \n\nCarly Fiorina, the one Republican woman in the race and the only candidate to rise from last month's undercard debate to Wednesday's main stage, offered passionate calls for defunding women's health care provider Planned Parenthood, a publicly funded organization that offers abortions. \n\nFiorina, the former chief executive of Hewlett-Packard, also delivered a withering response to insulting comments about her looks that Trump made in a recent magazine interview. \n\n\"I think women all over this country heard very clearly what Mr. Trump said,\" she said, offering him a cold stare. \n\nAFP / Frederic J Brown \nRepublican presidential hopefuls George Pataki (L), Rick Santorum (C) and Rand Paul arrive for the Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California, September 16, 2015 \n\nTrump did not ignore the assaults, taking digs at rivals from virtually his first moments on stage. \n\n\"First of all, Rand Paul shouldn't even be on this stage. He's number 11 and has one percent in the polls,\" Trump said of the Kentucky senator who has signalled he would not hesitate to take the gloves off with Trump. \n\nPaul, who has slipped in the polls since brusquely criticizing Trump in the first debate, attacked Trump's \"junior high\" snarls. \n\n\"Are we not way above that? Would we not all be worried to have someone like that in charge of the nuclear arsenal?\" Paul asked. \n\nEarlier, a foursome of low-polling candidates took their shots at Trump in the \"undercard\" debate. \n\nA fiery Senator Lindsey Graham warned against nominating \"cartoon character\" Trump, while former New York governor George Pataki declared Trump \"unfit to be president of the United States.\" \n\nAFP / Frederic J Brown \nCarly Fiorina, the former chief executive of Hewlett-Packard, delivered a withering response to insulting comments about her looks that Donald Trump made in a recent magazine interview \n\nThe main event's 11 candidates clashed extensively on issues including immigration, how to handle a looming government shutdown, and dealing with Russian President Vladimir Putin. \n\nJeb Bush, perhaps the campaign's ultimate establishment Republican, has seen his political fortunes tumble in the months since Trump entered the race, and he sought to claw back some of his lost ground by projecting himself as an even-keeled conservative who can lead from day one. \n\n\"You can't just, you know, talk about this stuff and insult leaders around the world and expect a good result,\" Bush said. \n\n\"You have to do this with a steady hand, and I believe I have those skills.\" \n\n- Anti-establishment rise - \n\nAs more conventional candidates like Ohio Governor John Kasich and Senator Marco Rubio struggle to gain precious air time with the media, which is spending vast time and resources on covering Trump, another outsider, retired neurosurgeon Ben Carson, has quietly gained ground. \n\nThe latest CBS News poll found Trump still ahead at 27 percent support, but the soft-spoken Carson -- who is essentially the anti-Trump -- swelled to 23 percent. \n\nWhile it is unclear whether Carson poses an immediate threat to Trump's dominance, the rise of the doctor, who like Trump has never held public office, is more evidence of an anti-establishment wave washing over the 2016 nomination race. \n\n\"I'm extraordinarily concerned about the direction of this country, the fiscal irresponsibility, the failure to take a leadership position in the world,\" Carson said. \n?? 2015 AFP",
  "Source":"Look Local",
  "NewsTitle":"Trump targeted in US Republican debate",
  "mediaType":"News",
  "DateTime":"2016-09-04 21:44:25.0",
  "sliderData":[{
    "parameter":"parameter0",
    "min":0,
    "max":100,
    "val":80
  },{
    "parameter":"parameter1",
    "min":0,
    "max":100,
    "val":80
  },{
    "parameter":"parameter2",
    "min":0,
    "max":100,
    "val":20
  },{
    "parameter":"parameter1",
    "min":0,
    "max":100,
    "val":60
  },{
    "parameter":"parameter2",
    "min":0,
    "max":100,
    "val":40
  }]
}
