{"status":3,"message":"CoefedNewsDetailQuery","NewsId":"2d521d1f-dd75-4a12-9bfe-db3f051f7e16","NewsContent":"Since the last House of <b>the Assembly election<\/b> which saw the Peoples Democratic Party (PDP) in Ondo State winning 21 of the 26 seats, the party has further consolidated on <b>the last House of <b>the Assembly election<\/b> which saw the Peoples Democratic Party -LRB- PDP -RRB- in Ondo State winning 21 of the 26 seats<\/b> control of the state's political space.\nIn this interview, the state Commissioner for Information, Hon Kayode Akinmade, speaks on how the Dr. Olusegun Mimiko-led PDP government has been able to endear <b>the party<\/b> to the people through landmark achievements.\nThe PDP in <b>Ondo State winning 21 of the 26 seats<\/b> seems to be consolidating <b>The PDP in Ondo State<\/b> hold on the political terrain since <b>the last House of <b>the Assembly election<\/b> which saw the Peoples Democratic Party -LRB- PDP -RRB- in <b>Ondo State winning 21 of the 26 seats<\/b> winning 21 of the 26 seats<\/b>.\nHow has <b>The PDP in Ondo State<\/b> happened?\nSo far so good.\n<b>The PDP in <b>Ondo South<\/b> State<\/b> is getting sure-footed, fresher and more robust with members getting happier and more at peace with <b>members<\/b> and with the remarkable performance of <b>the Dr. Olusegun Mimiko-led PDP government<\/b>.\nIn fact, <b>The PDP in Ondo State<\/b> could only get better because <b>better<\/b> is what is happening.\nThe April 11 election represented the yearnings of the people of <b>Ondo State winning 21 of the 26 seats<\/b>.\n<b>The April 11 election<\/b> was an <b>Ondo State winning 21 of the 26 seats<\/b> affair and our performance in <b>The April 11 election<\/b> is a thing <b>our<\/b> will continue to celebrate the people of <b>Ondo State winning 21 of the 26 seats<\/b> for.\n<b>The April 11 election<\/b> was <b>The April 11 election<\/b> forward.\n<b>our<\/b> secured 21 of the <b>26<\/b> seats in <b>the last House of Assembly election which saw the Peoples Democratic Party -LRB- PDP -RRB- in Ondo State winning <b>21 of <b>the 26 seats<\/b><\/b><\/b>.\n<b>a clear indication of acceptance of the PDP by the people<\/b> is a clear indication of acceptance of the PDP by <b>the people<\/b>.\nThe result of <b>The April 11 election<\/b> speaks volumes showing that the people of <b>Ondo South<\/b> have implicit confidence in the leadership of Dr Olusegun Mimiko and <b>the PDP by the people<\/b>.\nYou think you can repeat the <b>the last House of Assembly election which saw the Peoples Democratic Party -LRB- PDP -RRB- in Ondo State winning 21 of the 26 seats<\/b> election feat in future elections in <b>Ondo State winning 21 of the 26 seats<\/b>?\n<b>the PDP by the people<\/b> is the masses party in <b>Ondo State winning 21 of the 26 seats<\/b> and is well prepared.\nWe have equally embarked on a mutually inclusive restructuring programme to give every member of <b><b>the party<\/b><\/b>, a sense of belonging.\nPDP is going through genuine integration.\nLook at the recent composition of caretaker committee chairmen at the various local governments, <b>We<\/b> have members drawn from major interests within <b>the party<\/b>.\nDuring the March presidential election, <b><b>the party<\/b><\/b> took so many things for granted, not knowing that some of <b>We<\/b> former leaders, trusted with sensitive positions, had planned to work with the opposition in order to wreak havoc on <b>the party<\/b>.\nAs soon as <b>The April 11 election<\/b> was done with, <b>We<\/b> <b>We<\/b>nt back to the drawing board for a quick comeback.\nWith the support of <b>the people<\/b>, <b>We<\/b> <b>We<\/b>re able to recover lost grounds within two <b>We<\/b>eks .\nThen the black legs, who undermined <b>We<\/b> structures in <b>the March presidential election<\/b>, came out in <b>the people<\/b> true col<b>We<\/b>s by decamping to the APC and that gave <b>We<\/b> the opportunity to re-strategize and <b>The result of that election<\/b> shocked <b>the people<\/b> bookmakers.\nMoreover, the issues that surrounded <b>Ondo State winning 21 of the 26 seats<\/b> <b>the last House of <b>the Assembly election<\/b> which saw the Peoples Democratic Party -LRB- PDP -RRB- in Ondo State winning 21 of the 26 seats<\/b> made <b>Ondo State winning 21 of the 26 seats<\/b> absolutely difficult for <b>We<\/b> people to go beyond matters connected w<b>Ondo State winning 21 of the 26 seats<\/b>h <b>The local variables<\/b>.\nThe local variables are that the <b>Ondo State winning 21 of the 26 seats<\/b> people will determine who and who will represent <b>the Ondo State people<\/b> at the parliament of <b>Ondo State winning 21 of the 26 seats<\/b>.\nYou are so confident <b>the party<\/b> will continue to hold sway in <b>Ondo State winning 21 of the 26 seats<\/b>.\nWhere is this confidence coming from?\n<b>this confidence<\/b> is coming from the demonstration of love and loyalty by the people who always demonstrate <b>the Ondo State people<\/b> appreciate the leadership and selfless commitment of <b>Olusegun Mimiko<\/b> to ensure that <b>the Ondo State people<\/b> live decent lives which is evident in the various programmes of <b>the Dr. Olusegun Mimiko-led PDP government<\/b>.\nTake a look at the urban renewal feat of <b>the Dr. Olusegun Mimiko-led PDP government<\/b>.\n<b>a look<\/b> is not for fun that the United Nations honoured the governor with the <b>the United Nations<\/b> Scroll of Honour Award for <b>the governor<\/b> achievements in urban renewal.\nToday, Akure major roundabouts have become some tourists attraction with the water fountain providing beautiful scenery while the greenery has become a toast to the environment, providing health benefits for the citizenry.\nWe know what the infant and maternal mortality rate was in the state before the <b>Olusegun Mimiko<\/b> administration.\nIt was a thing of great fear to be pregnant in <b>Ondo South<\/b> before <b>the Mimiko administration<\/b> came on board.\nToday, <b>the infant<\/b> efforts at eradicating deaths at child birth are so pronounced that the World Health Organization (<b>the infant<\/b>) took <b>the World Health Organization -LRB- WHO -RRB-<\/b> upon <b>the World Health Organization -LRB- WHO -RRB-<\/b>self to tell the whole world that other governments should come to <b>We<\/b> state to understudy <b>the World Health Organization -LRB- WHO -RRB-<\/b>s safe motherhood project (Abiye) which gave birth to the Mother and Child Hosp<b>the World Health Organization -LRB- WHO -RRB-<\/b>al and the Agbebiye projects.\nHealth care in <b>Ondo South<\/b>, as bad as the economy is nationwide, is still free.\n<b>Health care in Ondo , as bad as the economy is nationwide<\/b> is why you see <b>the people<\/b> from neighbouring states rushing to <b>Ondo State winning 21 of the 26 seats<\/b> to access the free health care.\nBut <b>We<\/b> are now streamlining and maximizing this opportunity for the greater benefit of <b><b>We<\/b> people to go beyond matters connected with local variables<\/b> with the introduction and deployment of Kaadi Igbeayo, a multi-purpose smart card with limitless opportunities.\nIf you are not resident in <b>Ondo State winning 21 of the 26 seats<\/b>, you cannot have <b>a multi-purpose smart card with limitless opportunities<\/b> and, before you can enjoy <b>We<\/b> free health now, you must present <b>a multi-purpose smart card with limitless opportunities<\/b>.\nThis is to ensure that <b>our free health<\/b> and other benefits of <b><b>We<\/b> people to go beyond matters connected with local variables<\/b>, in relation to education , micro-credit, transportation, agric inputs, among others, are prioritized.\nAre <b>his achievements in urban renewal<\/b> in the health sector not on account of <b>the governor<\/b> being a medical doctor ?\n<b>Olusegun Mimiko<\/b> is not the only governor who is <b>a medical doctor<\/b>.\nThe issue is about governance w<b>The issue<\/b>h passion, <b>The issue<\/b>'s about advancing the frontiers of governance.\nBefore Mimiko's government, the only dualised road we had was the Oba Adesida Road, <b>Akure<\/b> and <b>Oba Adesida Road<\/b> was w<b>Oba Adesida Road<\/b>hout road furn<b>Oba Adesida Road<\/b>ure.\nTo the glory of God and ingenuity of the <b>Olusegun Mimiko<\/b> government, there are about six dualised roads in <b>Ondo State winning 21 of the 26 seats<\/b> now.\nThose who knew what Arakale Road used to be should be able to say what <b>Those who knew what Arakale Road used to be<\/b> is now; d<b>Those who knew what Arakale Road used to be<\/b>to for Owo, <b>Ondo South<\/b>,Igbokoda and other roads that have been dualised or being dualised.\nThese are <b>These<\/b>; infact with all the road furniture available in developed countries.\nNow, see the turnaround in our education system.\nApart from the special attention <b>the Dr. Olusegun Mimiko-led PDP government<\/b> is giving to the welfare of teachers, <b>our<\/b> Mega Schools have become a model.\nOther governments have been visiting the state to understudy <b>the special attention<\/b> health and education models.\nOndo State University of Science and Technology founded in Ondo South by the previous government did not take off until <b>the previous government<\/b> came in.\nToday, students of <b>Ondo State University of Science and Technology founded in Ondo South by the previous government<\/b> are approaching graduation.\nThe other <b>Ondo South<\/b> State-owned university, Akungba-Akoko is one of the best state universities, as rated by the United States Transparency International Standard.\nThe Senate Building in the university recently commissioned by <b>Olusegun Mimiko<\/b> is <b>The Senate Building in the university recently commissioned by Governor Mimiko<\/b>.\nMore importantly, Adekunle Ajasin University charges the least tuition fees in the country.\nThis is what we call social welfare from a responsible government and <b>the people<\/b> are better for <b>This<\/b>.\n<b>we<\/b> also have the free school shuttle buses for pupils across <b>Ondo State winning 21 of the 26 seats<\/b>.\nIn the area of security, <b>Ondo State winning 21 of the 26 seats<\/b> has witnessed peace and tranquility occasioned by the responsible leadership of <b>Olusegun Mimiko<\/b>.\nSome of <b>the Agbebiye projects<\/b> <b>the opposition<\/b> is criticizing are being copied in some of <b>neighb<b>we<\/b>ing states rushing to the state to access the free health care<\/b>.\nGo to Osun and Oyo, <b>Some of our projects the opposition is criticizing<\/b> are trying to follow on <b>we<\/b> footsteps.\n<b>Some of our projects the opposition is criticizing<\/b> too are building markets, mega schools and even aping the school <b>the free school shuttle buses for pupils across the state<\/b> and so on.\nIn <b>Ondo South<\/b>, government creates jobs through mechanised agriculture.\nA visit to government farms in Auga, Epe, Isuada and Ore will show how well <b>the previous government<\/b> has improved agriculture with many of <b>we<\/b> youths developing careers there.\nToday, cocoa farmers in <b>Ondo State winning 21 of the 26 seats<\/b> will tell you the transformation that has come into <b>cocoa farmers in the state<\/b> trade as a result of the government revolution in cocoa even as <b>we<\/b> chocolate experiment won an award in England.\nAre you aware that in <b>Ondo South<\/b>, <b>Ondo South<\/b> takes just eight weeks to get a C of O and for as cheap as N15,000?\nAnd you don't think the defection of some bigwigs from <b>the party<\/b> to the oppos<b>a difference<\/b>ion will make a difference in future elections in <b>Ondo State winning 21 of the 26 seats<\/b> like <b>a difference<\/b> did at the last presidential election?\nWho are <b>some bigwigs from your party<\/b>?\nAre you referring to those who left <b>the party<\/b> on the eve of <b>the last House of <b>the Assembly election<\/b> which saw the Peoples Democratic Party -LRB- PDP -RRB- in Ondo State winning 21 of the 26 seats<\/b> thinking <b>some bigwigs from your party<\/b> exit will make <b>a difference<\/b> and got the greatest shock of <b>decent lives which is evident in the various programmes of the government<\/b>?\nThose you referred to as <b>some bigwigs from your party<\/b> are paper weight and inconsequential as far as <b>Ondo South<\/b> politics is concerned.\nSome of the so-called bigwigs defected before <b>the last House of <b>the Assembly election<\/b> which saw the Peoples Democratic Party -LRB- PDP -RRB- in Ondo State winning 21 of the 26 seats<\/b>.\nAhead of <b>the March presidential election<\/b>, <b>our<\/b> had <b>the issues that surrounded the state House of Assembly election<\/b> but <b>our<\/b> won bigger at the Assembly election after <b>Some of the so-called bigwigs<\/b> had left.\nThis means that <b>those who left our party on the eve of the House of Assembly election thinking their exit will make a difference and got the greatest shock of their lives<\/b> are inconsequential, <b>This<\/b> are not <b>some bigwigs from your party<\/b> as you described <b>This<\/b>.\n<b>This<\/b> leaving has no effect on <b>the party<\/b>; infact, <b>Their leaving<\/b> brought peace, progress, fresh drive and determination to excel into <b><b>our<\/b><\/b> and <b>the party<\/b> remains a strong party.\nDo you not think the domineering effect of <b>the APC<\/b> at the national level would rub off on the electoral fortunes of <b>the APC<\/b> to the disadvantage of <b>The PDP in <b>Ondo South<\/b> State<\/b>?\nLet me say once again that <b>Ondo State winning 21 of the 26 seats<\/b> has never been hoodwinked by any bandwagon effect.\nThe major consideration has always been performance and commitment to collective goals and ideals.\nYou will recollect that <b>Ondo South<\/b> was in the opposition under the regime of Pa Michael Adekunle Ajasin of the Unity Party of Nigeria, <b>Unity Party of Nigeria<\/b>, and yet <b>the people<\/b> stood by <b>the people<\/b> mandate on account of <b>the people<\/b> value system.\nJust as <b>Ondo South<\/b> was yesterday, so <b>Ondo South<\/b> is today because the government of the day is delivering on <b>Ondo South<\/b>s mandate w<b>Ondo South<\/b>h life impacting <b>the various programmes of the government<\/b> throughout the state.the Assembly election after <b>the people<\/b> had left.\nThis means that <b>those who left our party on the eve of the House of Assembly election thinking their exit will make a difference and got the greatest shock of their lives<\/b> are inconsequential, <b>This<\/b> are not <b>some bigwigs from your party<\/b> as you described <b>This<\/b>.\n<b><b>This<\/b> leaving<\/b> has no effect on <b>the party<\/b>; infact, <b><b>This<\/b> leaving<\/b> brought <b>peace , progress , fresh drive and determination<\/b> to excel into <b><b>our<\/b><\/b> and <b>the party<\/b> remains <b>a strong party<\/b>.\nDo you not think the domineering effect of <b>the APC<\/b> at <b>the national level<\/b> would rub off on the electoral fortunes of <b>the APC<\/b> to the disadvantage of <b>The PDP in <b>Ondo South<\/b> State<\/b>?\nLet <b>me<\/b> say once again that <b>Ondo State winning 21 of the 26 seats<\/b> has never been hoodwinked by any bandwagon effect.\n<b>The major consideration<\/b> has always been <b>performance and commitment to <b>collective goals and ideals<\/b><\/b>.\nYou will recollect that <b>Ondo South<\/b> was in the opposition under the regime of Pa Michael Adekunle Ajasin of the <b>Unity Party of Nigeria<\/b>, <b>Unity Party of Nigeria<\/b>, and yet <b>the people<\/b> stood by <b>the people<\/b> mandate on account of <b>the people<\/b> value system.\nJust as <b>Ondo South<\/b> was <b>yesterday<\/b>, so <b>Ondo South<\/b> is today\n","NewsTitle":"2015 Polls - How Ondo PDP Recovered Lost Grounds in Two Weeks [interview]","MediaType":"News","Source":"Individual.com","DateTime":"2015-09-15 12:00:00.0"}
