{"status":3,"message":"CoefedNewsDetailQuery","NewsId":"4662e6ab-0053-4a72-88fb-c6e190882e1e","NewsContent":"Marco Rubio has no shortage of problems with the way President Obama has conducted <b>Obama<\/b> foreign policy.\nThe Florida senator and GOP presidential candidate says the <b>Obama<\/b> administration left \"chaos\" behind in the Middle East after withdrawing troops from Iraq in 2011.\nIn an interview with NPR's Steve Inskeep, <b>Marco Rubio<\/b> says that Russia has gained leverage from the perception that the United States abandoned the region.\n<b>Russia<\/b> has been sending heavy equipment — including warplanes — and troops into Syria.\n<b>Iraq in 2011<\/b> also announced an intelligence-sharing arrangement with Moscow over the weekend in the fight against ISIS.\n<b>Marco Rubio<\/b> says <b>the United States<\/b> has failed to be a reliable ally to countries in the region battling <b>ISIS<\/b>.\nT<b>Marco Rubio<\/b>refore, <b>Marco Rubio<\/b> says, \"If left with a choice between <b><b>Russia<\/b><\/b> and nothing, t<b>Marco Rubio<\/b>y're going to choose <b><b>Russia<\/b><\/b>.\"\nThe U.S. has led an air campaign against <b>ISIS<\/b> in <b>Iraq in 2011<\/b> and <b>Syria<\/b>, backed by Western and Arab allies.\nBut efforts to mount a ground force to battle the extremists, or hold territory cleared by airstrikes, have flagged.\n<b>Marco Rubio<\/b> has also pledged to scrap the nuclear deal with Iran, if elected, on <b>Marco Rubio<\/b> first day in office.\n<b>Marco Rubio<\/b> does not believe <b>Iran<\/b> will stick to <b>the nuclear deal<\/b>, despite assurances by <b>Iran<\/b>ian President Hassan Rouhani in an NPR interview <b>the weekend in the fight against ISIS<\/b> that <b>Iranian President Hassan Rouhani in an NPR interview<\/b> country has a \"religious obligation\" to do so.\n<b>Iranian President Hassan Rouhani in an NPR interview<\/b> said statements by <b>Marco Rubio<\/b> and other <b>GOP<\/b> presidential candidates that <b>Rubio and other GOP presidential candidates<\/b> would like to terminate the deal fuel skepticism in <b>Iran<\/b> that <b>The U.S.<\/b> will keep <b>The U.S.<\/b> promises.\n<b>Marco Rubio<\/b> predicts that <b>Iran<\/b> will eventually claim technicalities to \"erode the deal's restrictions on <b>Rubio and other GOP presidential candidates<\/b>.\"\n<b>Marco Rubio<\/b> adds, \"<b>Rubio and other GOP presidential candidates<\/b>'ll challenge <b>GOP presidential candidates<\/b>, <b>GOP presidential candidates<\/b>'ll gamble that the West and <b>the United States<\/b> has so much invested in the success of this deal that we will tolerate those violations.\"\n<b>the nuclear deal<\/b> was secured on Capitol Hill despite strong opposition from <b>Marco Rubio<\/b> and other Republicans, who control both the House and Senate.\nIn the wake of <b>House<\/b> Speaker John Boehner's surprise resignation, which <b>Marco <b>Marco Rubio<\/b><\/b> announced to cheers at a conference of social conservatives in Washington on Friday, <b>Marco <b>Marco Rubio<\/b><\/b> says of the frustration with the <b>GOP<\/b> establishment, \"<b>the wake of House Speaker John Boehner's surprise resignation , which Rubio announced to cheers at a conference of social conservatives in Washington on Friday<\/b>'s very real.\"\n\"<b>social conservatives in Washington<\/b> know people are upset that <b>people<\/b> elected a <b>Republican-majority<\/b> <b>Senate<\/b>, have a <b>Republican-majority<\/b> <b>House<\/b>, and yet <b>people<\/b> seem incapable of getting anything done,\" <b>Marco Rubio<\/b> says.\nConservatives in Congress are likely facing another disappointment this week, as the <b>GOP<\/b> leadership appears capable of keeping the government funded past a Sept. 30 deadline, without stripping federal money for Planned Parenthood.\n<b>Marco Rubio<\/b> says the Republican establishment gave up in the fight against <b><b>Planned Parenthood<\/b><\/b>.\n\"T<b>Marco Rubio<\/b>y didn't think t<b>Marco Rubio<\/b>y could win t<b>Marco Rubio<\/b> public debate, and so t<b>Marco Rubio<\/b>y never even tried,\" <b>Marco Rubio<\/b> tells <b>NPR's<\/b>.\nAttacking the party establishment appears to be smart politics in a campaign season when political outsiders have captured the energy in the presidential race.\n<b>Marco Rubio<\/b> has been in <b>smart politics<\/b> since <b>Marco Rubio<\/b> won a seat on t<b>Marco Rubio<\/b> West Miami City Commission in 1998.\n<b>Marco Rubio<\/b> then rose through the ranks of Florida's state Legislature, eventually taking the mantle of speaker in the state House of Representatives, before being elected to the U.S. Senate in 2010 with the backing of the Tea Party.\n<b>Marco Rubio<\/b> has picked up steam recently in <b>the presidential race<\/b>, both in polls and by inheriting key campaign resources from Wisconsin Gov. Scott Walker, who dropped out of <b>the presidential race<\/b> last week.\nPerhaps t<b>Marco Rubio<\/b>re's no clearer sign that <b>Marco Rubio<\/b> is performing better than t<b>Marco Rubio<\/b> fact that <b>Marco Rubio<\/b>'s come under attack by Donald Trump.\nIn a pair of cable TV interviews <b>last week<\/b>, <b>Donald Trump<\/b> called <b>Marco Rubio<\/b> a \"kid\" and mocked <b>Donald Trump<\/b> for getting \"sweaty\" during the last <b>GOP<\/b> debate, where several candidates complained of the heat on stage.\nSince then, the two candidates have been engaged in a tit-for-tat.\n<b>Marco Rubio<\/b> responded by saying that <b>Donald Trump<\/b> is \"touchy and insecure\" in an interview with Kentucky Sports Radio on Thursday.\nAt the Values Voter Summit in Washington on <b>Friday<\/b>, Trump called Rubio a \"clown\" — drawing sustained boos from the crowd of <b>social conservatives in Washington<\/b>.\n<b>Marco Rubio<\/b>n response, <b>Marco Rubio<\/b> tells <b>NPR's<\/b>, \"<b>Marco Rubio<\/b>'m not interested in the back and forth.\"\n<b>Marco Rubio<\/b> then went on to further <b>Marco Rubio<\/b> criticism of <b>Donald Trump<\/b>, referring to <b>Marco Rubio<\/b> presence in the race as a \"freak show.\" \n[Trump] is <b>Donald Trump<\/b>.\n<b>Donald Trump<\/b> doesn't like to be criticized.\n<b>Donald Trump<\/b> responds to criticism very poorly,\" <b>Marco Rubio<\/b> says.\n\"<b>Marco Rubio<\/b> poll numbers have taken a beating, and <b>Marco Rubio<\/b> was embarrassed on national television at t<b>Marco Rubio<\/b> debate by Carly Fiorina and ot<b>Marco Rubio<\/b>rs.\"\n\"But this election is not going to be about <b>Donald Trump<\/b>,\" <b>Marco Rubio<\/b> adds.\n\"<b>Donald Trump<\/b> thinks <b>this election<\/b> is, but <b>this election<\/b>'s not about <b>Donald Trump<\/b>.\n<b>this election<\/b> has to be about the issues confronting <b>Carly Fiorina and others<\/b> country.\nAnd <b>Marco Rubio<\/b> sense of <b>this election<\/b> is that every time issues become prominent, <b>Donald Trump<\/b> will say something outrageous or do something outrageous so that <b>Donald Trump<\/b> doesn't have to talk about <b>t<b>Donald Trump<\/b> issues<\/b>.\n\"ng that <b>Donald Trump<\/b> is \"touchy and insecure\" in an interview with Kentucky Sports Radio on Thu\n","NewsTitle":"Sen. Marco Rubio","MediaType":"News","Source":"KUNC 91.5 FM","DateTime":"2015-09-28 09:00:00.0"}
