{"status":3,"message":"CoefedNewsDetailQuery","NewsId":"63ce76ef-5ebb-46ce-ae31-2ce55a9c7884","NewsContent":"WASHINGTON (Reuters) - On the campaign trail, Republican presidential candidates vow to roll back new U.S. education standards known as the Common Core.\nIn the classroom, the multi-state guidelines increasingly look like <b>they<\/b>'re here to stay.Since <b>they<\/b> were adopted by 46 states five years ago, the Common Core standards have become a symbol of Big Government overreach for conservatives.\nRepublican Senator Ted Cruz, <b>Ted Cruz<\/b>, has promised to \"repeal every word of Common Core.\"\nRivals Bobby Jindal and Chris Christie, both governors who previously backed the standards, now condemn <b>Rivals Bobby Jindal and Chris Christie<\/b>.\nOf 17 <b>Republican<\/b> candidates, only Jeb Bush and John Kasich are Common Core defenders.Yet despite years of effort, Common Core's critics have largely failed to repeal <b><b>the standards<\/b><\/b>, education officials have been reluctant to wipe the slate clean after spending millions of dollars to train <b>Teachers<\/b> and develop new course work.\nTeachers have also become vocal Common Core backers, lobbying parents and politicians to keep the new system in place.\nAnd any <b>Republican<\/b> president would find <b>the new system<\/b> difficult to abolish a system that has mostly been implemented by states.Two states that have rolled back the standards have replaced <b>Teachers<\/b> w<b>the new system<\/b>h nearly identical guidelines, while nine states that are reviewing <b>Teachers<\/b> are likewise expected to leave <b>Teachers<\/b> largely intact.\n\"In most places, the political battle has been won by the defenders of <b>the Common Core<\/b>,\" said backer Michael Petrilli, president of the conservative Thomas B. Fordham Institute.Conservative activists, meanwhile, are frustrated that <b>Thomas B. Fordham Institute.Conservative activists<\/b> haven't had more success.\n\"<b>Erin Tuttle , an Indiana homemaker who worked to repeal the guidelines only to see state officials replace <b>state officials<\/b> with a similar set of standards.At <b>a long-standing tension within U.S. education<\/b> is a long-standing tension within U.S. education<\/b> would give up <b>Erin Tuttle , an Indiana homemaker who worked to repeal the guidelines only to see state officials replace <b>state officials<\/b> with a similar set of standards.At <b>a long-standing tension within U.S. education<\/b> is a long-standing tension within U.S. education<\/b> right pinky if any of <b>states.Two states that have rolled back the standards have replaced <b>state officials<\/b> with nearly identical guidelines , while nine states that are reviewing <b>state officials<\/b> are likewise expected to leave <b>state officials<\/b> largely intact<\/b> come up with standards that are substantially different from Common Core,\" said Erin Tuttle, an <b>Erin Tuttle , an Indiana homemaker who worked to repeal the guidelines only to see state officials replace <b>state officials<\/b> with a similar set of standards.At <b>a long-standing tension within U.S. education<\/b> is a long-standing tension within U.S. education<\/b>ndiana homemaker who worked to repeal <b>nearly identical guidelines<\/b> only to see state officials replace <b>state officials<\/b> with a similar set of standards.At <b>a long-standing tension within U.S. education<\/b> is a long-standing tension within U.S. education.\nBusiness leaders say U.S. schools must become more consistent and rigorous in order to turn out graduates who can help the country compete in the global economy.\nInternational tests often show that U.S. students lag <b>U.S. students<\/b> peers in other industrialized countries.\nIn one 2012 math test, <b>U.S. students<\/b> ranked 27th among the 34 members of the <b>the Organization<\/b> and Development.Meanwhile, some parents worry that distant government and corporate interests are hijacking <b>schools , which in the United States historically have been controlled at the local level.Although Common Core was developed by Republican and Democratic governors and state education officials<\/b>, which in the Un<b>one 2012<\/b>ed States historically have been controlled at the local level.Although Common Core was developed by <b>Republican<\/b> and Democratic governors and state education officials, President Barack Obama also played a significant role by encouraging states to adopt <b>one 2012<\/b> through a $4.4 billion grant program in 2009.\nCommon Core also has been caught up in a backlash against  standardized testing, which <b>Common Core's critics<\/b> say stifles creativity and eat up too much classroom time.\nThese complaints predate Common Core by more than a decade, but <b>Common Core's critics<\/b> have been intensified as <b>schools , which in the United States historically have been controlled at the local level.Although Common Core was developed by Republican and Democratic governors and state education officials<\/b> have revamped <b>Common Core's critics<\/b> tests to reflect the new standards.Half of all high school students in some districts in <b>WASHINGTON -LRB- Reuters -RRB- - On the campaign trail , Republican presidential candidates vow to roll back new U.S. education standards<\/b> state and Long Island, New York boycotted <b>the local level.Although Common Core<\/b> standardized tests earlier this year.\nIn the coming school <b>earlier this year<\/b>, <b>nine<\/b> states will abandon tests that were developed to accompany Common Core in favor of <b>Common Core's critics<\/b> own assessments.\nExperts say <b>Experts<\/b> will make <b>the coming school<\/b> more difficult to compare results across state lines.But even as the tests change, <b>the standards<\/b> are becoming deeply embedded in the nation's schools as <b>Teachers<\/b> incorporate <b>Teachers<\/b> into <b>Teachers<\/b> lesson plans.\n\"<b>the best shift in education <b>Debra Troxell<\/b> 've seen since <b>Debra Troxell<\/b> started teaching 25 years ago<\/b> is the best shift in education <b>Debra Troxell<\/b>'ve seen since <b>Debra Troxell<\/b> started teaching 25 years ago,\" said Debra Troxell, a high-school geography teacher in Forsyth County, North Carolina.CR<b>Debra Troxell<\/b>T<b>Debra Troxell<\/b>CAL TH<b>Debra Troxell<\/b>NK<b>Debra Troxell<\/b>NGThe Common Core <b>standards that are substantially different from Common Core<\/b> spell out what <b>U.S. students<\/b> should know at the end of the school year, but leave implementation to <b>Teachers<\/b> and local officials.\nFor instance, sixth graders are expected to understand statistical concepts, while high schoolers are expected to write essays advancing an argument.Business groups and other backers say <b>the standards<\/b> better prepare high school graduates for the workforce.\nTeachers' unions back <b>the standards<\/b> as well, though <b>Teachers<\/b> oppose linking test results to teachers' pay.\n<b><b>the standards<\/b><\/b> have a powerful advocate in Microsoft Corp founder Bill Gates, who has spent more than $200 million to promote them.But <b>the standards<\/b> have baffled some parents who struggled to understand <b>Teachers<\/b> children's homework, building on concerns about too much testing and lack of local control.South Carolina repealed Common Core in 2014.\nBut <b>local officials<\/b> there have since adopted new standards that are 90 percent similar, according to a state oversight committee.\nIndiana's new standards also largely mirror Common Core.Oklahoma has reverted to <b>Indiana<\/b> pre-Common Core standards while <b>local officials<\/b> develop a replacement.\nEight other states are reexamining <b>the standards<\/b>, but there is little expectation of a major departure in policy.\n\"<b>Eight<\/b>'s sort of like putting a cow in a horse costume.\n<b>Eight<\/b>'s still <b>a cow<\/b>,\" said Emily Mitchell, <b>Emily Mitchell<\/b>, said <b>Adam Brandon<\/b>.\n\"Are <b>conservative activists<\/b> happy?\nNo,\" <b>Adam Brandon<\/b> said.\n\"But the <b>Republican<\/b> nominee for president, chances are, is going to be very much against Common Core.\n\"<b>chances are<\/b> may not mean much, though.\nWhoever wins the election in 2016 is likely to have less sway over education than <b>President Barack Obama<\/b> because Congress is advancing legislation to prohibit the federal government from influencing state learning standards.By that point, <b>other backers<\/b> say, Common Core will have already transformed <b>U.S. education<\/b>.\n\"We've seen Common Core hold pretty true across <b>the country<\/b>,\" said <b>Chris Minnich<\/b>.\n(This version corrects spelling of Michael Petrilli's name, <b>spelling of Michael Petrilli's name<\/b>) (Reporting by Andy Sullivan; Editing by Kevin Drawbaugh and Stuart Grudgings)<b>Emily Mitchell<\/b> are looking to <b>the presidential race<\/b>, rather than trying to roll back Common Core at <b>the state level<\/b>, said <b><b>Adam Brandon<\/b><\/b>.\n\"Are <b>Kevin Drawbaugh and Stuart Grudgings<\/b> happy?\n<b>No<\/b>,\" <b>Adam Brandon<\/b> said.\n\"But the <b>Republican<\/b> nominee for president, <b>chances are<\/b>, is going to be very much against Common Core.\n\"<b>chances are<\/b> may not mean much, though.\nWhoever wins <b>the election in <b>2016<\/b><\/b> is likely to have less sway over education than <b>President Barack Obama<\/b> because <b>Congress<\/b> is advancing legislation to prohibit <b>the federal government<\/b> from influencing state learning standards.By that point, <b>other backers<\/b> say, Common Core will have already transformed <b>U.S. education<\/b>.\n\"We've seen Common Core hold pretty true across <b>the country<\/b>,\" said <b><b>Chris Minnich<\/b><\/b>.\n(This version corrects spel\n","NewsTitle":"U.S. candidates slam Common Core, but education standards take root","MediaType":"News","Source":"The Fiscal Times","DateTime":"2015-09-10 15:00:00.0"}
