{
    "status": 3,
    "message": "CoefedNewsDetailQuery",
    "NewsId": "b0f4aee5-8935-4c41-93d8-56547ee5bd78",
    "NewsContent": "Hillary <b>Hillary <b>Hillary Clinton</b></b> is no longer the Democratic frontrunner for the second campaign; <b>Hillary <b>Hillary Clinton</b></b> is seeing <b>Hillary <b>Hillary Clinton</b></b> leads shrinks while an up and coming candidate over shadows <b>Hillary <b>Hillary Clinton</b></b>.\nA new NBC News/Marist Poll released on Sunday, Sept. 6, 2015 shows Vermont Senator Bernie Sanders now leads Clinton in the all important early primary state of New Hampshire.\nMeanwhile another poll by SurveyUSA released on Saturday, Sept. 5 proves that <b>Hillary Clinton</b> is no longer unstoppable and maybe real estate mogul Donald Trump has become that.\n<b>real estate mogul Donald Trump</b> leads <b>Hillary Clinton</b> and all the <b>Democratic</b> candidates in a general election matchup.\nIn the new <b>shows Vermont Senator Bernie <b>shows Vermont Senator Bernie Sanders</b></b> is now leading Clinton a by a nine point margin with <b>shows Vermont Senator Bernie Sanders</b> having 41 percent support to Clinton's 32 percent.\nMeanwhile Vice President Joe Biden has 16 percent support in <b>another poll by SurveyUSA released on Saturday , Sept. 5</b>.\n<b>Hillary <b>Hillary Clinton</b></b> is seeing the reverse position being in <b>second</b> place, in July's version of <b>another poll by SurveyUSA released on Saturday , Sept. 5</b> <b>Hillary <b>Hillary Clinton</b></b> had 42 percent support to <b>shows Vermont Senator Bernie Sanders</b> 32 percent with Biden at 12 percent.\n<b>shows Vermont Senator Bernie Sanders</b> is still in <b>only a mere 11 percent lead margin</b> if <b>Biden at 12 percent</b> chooses not to run, and with a larger margin over <b>Hillary Clinton</b>.\n<b>shows Vermont Senator Bernie Sanders</b> leads 49 percent to Clinton's 38 percent.\n<b>Hillary Clinton</b>, still has the upper hand in Iowa , <b>Iowa</b>.\n<b>Hillary Clinton</b> leads with 38 percent to <b>shows Vermont Senator Bernie Sanders</b> 27 percent.\n<b>only a mere 11 percent lead margin</b> is not much of a victory as <b>only a mere 11 percent lead margin</b> only a mere 11 percent lead margin, down from <b>Hillary Clinton</b> 24 percent lead just in <b>July's</b>.\n<b>Hillary Clinton</b> is underwater now in potential matchups with <b>Hillary Clinton</b> main Republican opponent, <b>real estate mogul Donald Trump</b>.\nThe new poll by <b>SurveyUSA released on Saturday , Sept. 5</b> gives <b>real estate mogul Donald Trump</b> the advantage over all <b>Democratic</b> candidates including <b>Hillary <b>Hillary Clinton</b></b>; in fact, <b>real estate mogul Donald Trump</b> margin over <b>Hillary <b>Hillary Clinton</b></b> is <b>a larger margin over Clinton</b>.\n<b>real estate mogul Donald Trump</b> leads <b>Hillary Clinton</b> 45 percent to 40 percent.\n<b>real estate mogul Donald <b>real estate mogul Donald Trump</b></b> leads Sanders 44 to 40 percent, former Vice President Al Gore who was rumored to plan a run, but will not loses to <b>real estate mogul Donald <b>real estate mogul Donald Trump</b></b> 44 percent to 41 percent.\n<b>another poll by SurveyUSA released on Saturday , Sept. 5</b> shows <b>Biden who trails only by 2 points , with 42 percent to Trump's 44 percent support</b> is Biden who trails only by 2 points, with 42 percent to Trump's 44 percent support.\nThe numbers show just how much trouble Clinton's campaign is in, The Hill looked at the progression from June to now show Clinton's poll lead margins in CNN/ORC sampling over <b>real estate mogul Donald Trump</b> have shrunk from 59 percent support to <b>real estate mogul Donald Trump</b>'s 34 percent national support to <b>trouble Clinton's</b> leading <b>Hillary Clinton</b> even if is just by five points.\n<b>real estate mogul Donald Trump</b> is certifiably <b>real estate mogul Donald Trump</b> by all accounts in t<b>real estate mogul Donald Trump</b> NBC/Marist Poll <b>real estate mogul Donald Trump</b> leads t<b>real estate mogul Donald Trump</b> field in <b><b>Iowa</b></b> and <b><b>New Hampshire</b></b>, with a 7-point margin in <b><b>Iowa</b></b> and 16 points in <b><b>New Hampshire</b></b>.\n<b>real estate mogul Donald Trump</b> leads in <b>Iowa</b> with 29 percent and 28 percent in <b>New Hampshire</b>.\nMeanwhile retired Neurosurgeon is in <b><b>second</b></b> place in <b>Iowa</b> with 22 percent, while Ohio Gov. John Kasich is seeing <b>Ohio Gov. John Kasich</b> poll numbers rise to <b><b>second</b></b> place with 12 percent in <b>New Hampshire</b>.\n<b>real estate mogul Donald Trump</b> has leaded nearly all t<b>real estate mogul Donald Trump</b> polls in t<b>real estate mogul Donald Trump</b> last month with t<b>real estate mogul Donald Trump</b> exception of one poll w<b>real estate mogul Donald Trump</b>re <b>real estate mogul Donald Trump</b> tied with Carson for <b>Iowa</b> support in a Monmouth University poll .\n<b>real estate mogul Donald Trump</b> now has t<b>real estate mogul Donald Trump</b> distinction of t<b>real estate mogul Donald Trump</b> voters believing <b>real estate mogul Donald Trump</b> would be t<b>real estate mogul Donald Trump</b> <b>GOP</b> nominee, until now trump led in t<b>real estate mogul Donald Trump</b> polls but Americans still though former Florida Governor Jeb Bush would be t<b>real estate mogul Donald Trump</b> inevitable nominee.\n<b>The new poll by SurveyUSA</b> shows 30 percent believe <b>real estate mogul Donald Trump</b> will be <b>real estate mogul Donald Trump</b>, only 20 percent feel that way now about <b>former Florida Governor Jeb Bush</b>.\nThe remaining top five includes <b>Carson for Iowa support</b>, Texas Sen. Ted Cruz and <b>Florida</b> Sen. Marco Rubio.\n<b>shows Vermont Senator Bernie Sanders</b> contributes the enthusiasm for <b>shows Vermont Senator Bernie Sanders</b> campaign as the reason for Clinton's downfall.\nSpeaking while campaigning in Altoona, <b><b>campaigning in Altoona , Iowa , Sanders</b>owa</b>, Sanders said , \"So obviously, <b>campaigning in Altoona , Iowa , Sanders</b> think the secretary's people are getting nervous about the energy and enthusiasm <b>trouble Clinton's campaign</b> is bringing forth.\"\nT<b>Secretary of State.rs</b> exc<b>T<b>Secretary of State.rs</b> excitement for Sanders and Trump</b>ement for <b>shows Vermont Senator Bernie Sanders</b> and <b>real estate mogul Donald Trump</b> might be affecting <b>Hillary Clinton</b>'s campaign, but nothing is doing <b>T<b>Secretary of State.rs</b> excitement for Sanders and Trump</b> more than <b>Hillary <b>Hillary Clinton</b></b> own going email scandal that only keeps growing and making t<b>Secretary of State.rs</b> American voter believe <b>Hillary Clinton</b> truly is untrustworthy, dishonest and a liar and possibly someone who abused <b>Hillary <b>Hillary Clinton</b></b> power as Secretary of State.rs believing <b>Secretary of State.rs</b> would be t<b>Secretary of State.rs</b> GO\n",
    "NewsTitle": "Both Donald Trump and Bernie Sanders are beating Hillary Clinton in latest polls",
    "MediaType": "News",
    "Source": "Examiner.com",
    "DateTime": "2015-09-06 21:00:00"
}
