{"status":3,"message":"CoefedNewsDetailQuery","NewsId":"ca605b70-4dda-4ed6-acf8-7270cc07e1e8","NewsContent":"SAN FRANCISCO, CA--(Marketwired - September 01, 2015) - The Asian American Journalists Association (AAJA) announced that <b>The Asian American Journalists Association<\/b> will partner with Asian & Pacific Islander American Vote (APIAVote) to bring a Presidential Candidate Town Hall to the 2016 AAJA National Convention August 10 - 13 in Las Vegas, NV.\n<b>the largest convergence of Asian Pacific Islander American professionals in the nation<\/b> will be the largest convergence of Asian Pacific Islander American professionals in the nation.\nSince 2008, <b>a Presidential Candidate Town Hall<\/b> has served as an avenue for <b>Asian Pacific Islander American<\/b> and Pacific Islander (<b>AAPI<\/b>) community to place <b>AAPI<\/b> issues on the radar of campaigns and the media.\n\"APIAVote is excited to partner with AAJA in bringing <b>a Presidential Candidate Town Hall<\/b> to <b>Las Vegas<\/b>,\" said Christine Chen, APIAVote Executive Director.\n\"AAPI voters are still largely untapped by <b>the Presidential candidates<\/b> and <b>AAPI voters<\/b> parties, even though this population continues to grow.\"\nAccording to <b>Christine Chen<\/b>, <b>67,806 -- though there are over 149,000 potential AAPI voters to be reached<\/b> was 67,806 -- though there are over 149,000 potential AAPI voters to be reached.\n\"<b>the two leading candidates<\/b> look forward to the participation of the Presidential candidates as <b>the Presidential candidates<\/b> directly address this growing base of new voters,\" said <b>Christine Chen<\/b>.\n\"<b>Paul Cheung , AAJA National President<\/b>'m excited to partner with AP<b>Paul Cheung , AAJA National President<\/b>AVote to welcome <b>a Presidential Candidate Town Hall<\/b> at <b>AAJA<\/b>'s 2016 convention,\" said Paul Cheung, <b>AAJA<\/b> National President.\n\"Asian <b>SAN FRANCISCO , CA -- -LRB- Marketwired - September 01 , 2015 -RRB- - The Asian American Journalists Association -LRB- AAJA -RRB-<\/b>n Pacific Islanders represent the fastest growing minority group in <b>SAN FRANCISCO , CA -- -LRB- Marketwired - September 01 , 2015 -RRB- - The Asian American Journalists Association -LRB- AAJA -RRB-<\/b>.\n<b>the two leading candidates<\/b> partnership will bring critical issues facing the AAPI community today onto a national platform during a presidential election year.\"\nAPIAVote partners with local community groups in 22 states and works to expand the AAPI electorate by organizing ongoing voter registrations drives and get-out-the-vote activities.\n\"Based on APIAVote's poll in <b>2012<\/b>, over 31% were undecided voters and during every Presidential cycle <b>a Presidential Candidate Town Hall<\/b> plays a key role in educating <b>the AAPI electorate<\/b> and preparing <b>undecided voters<\/b> to vote on Election Day,\" said <b>Johnnie Giles , chair of the APIAVote board of directors<\/b>, chair of the APIAVote board of directors.\n\"AAPIs are not only visible, but actively present in this election cycle.\nWith <b>AAJA<\/b>, <b>Johnnie Giles , chair of the APIAVote board of directors<\/b>'m certain that <b>directors<\/b> will elevate the profile of <b>directors<\/b> communities, and ensure <b>directors<\/b> voices are heard.\"\nThe <b>SAN FRANCISCO , CA -- -LRB- Marketwired - September 01 , 2015 -RRB- - <b>The Asian American Journalists Association<\/b> -LRB- AAJA -RRB-<\/b>n American Journalists Association  is a nonprofit professional and educational organization with more than 1,700 members across the United States and in <b>SAN FRANCISCO , CA -- -LRB- Marketwired - September 01 , 2015 -RRB- - <b>The Asian American Journalists Association<\/b> -LRB- AAJA -RRB-<\/b>.\nFounded in 1981, <b>AAJA<\/b> has been at the forefront of change in the journalism industry.\nAAJA's mission is to encourage <b>Asian Pacific Islander American<\/b> and Pacific Islanders (<b><b>AAPIs<\/b><\/b>) to enter the ranks of journalism, to work for fair and accurate coverage of <b><b>AAPIs<\/b><\/b>, and to increase the number of AAPI journalists and news managers in <b>the journalism industry<\/b>.\n<b>AAJA<\/b> is an alliance partner in UNITYnd get-out-the-vote activities.\n\"Based on APIAVote's poll in <b>2012<\/b>, over 31% were <b>undecided voters<\/b> and during every Presidential cycle <b>a Presidential Candidate Town Hall<\/b> plays <b>a key role<\/b> in educating the <b>AAPI<\/b> electorate and preparing <b>undecided voters<\/b> to vote on <b>Election Day<\/b>,\" said <b><b>Johnnie Giles , <b>chair of <b>the APIAVote board of directors<\/b> of directors<\/b> of directors<\/b> , <b>chair of <b>the APIAVote board of directors<\/b> of directors<\/b> of directors<\/b>\n","NewsTitle":"AAJA and APIAVote Partner to Bring Presidential Candidate Town Hall to 2016 AAJA Convention","MediaType":"News","Source":"BioSpace","DateTime":"2015-09-01 16:00:00.0"}
